var search =document.getElementsByClassName("search")[0];
var searchbar =document.getElementsByClassName("searchbar")[0];
var label = document.getElementsByClassName("label")[0];
function searchhover(){
	;
	closemenu();
	searchbar.style.animation = "";
	setTimeout(function(){
		searchbar.style.animation = "searchanimate 1.5s";
	},50);
	search.style.animation = "";
	setTimeout(function(){
		search.style.animation = "searchanimate 1.5s";
	},50);
	search.classList.toggle("searchdivchange");
	searchbar.classList.toggle("searchappear");
	label.classList.toggle("labeldisappear");
	searchbar.value = "";
	OninputSearch();
}


var actionarray = [

{
	review : "Bad Boys ရုပ်ရှင်တွေကို ရုပ်ရှင်ချစ်သူအတော်များများ သိကြမှာပါ။ ကျွန်တော်တို့ ငယ်ငယ်ကတည်းက ကြိုက်ခဲ့ရတဲ့အက်ရှင်ခပ်မြူးမြူးတွေပါပဲ။ အခုလည်း ဆရာကြီးနှစ်ယောက် အသက်ကြီးမှ တကြော့ပြန်လာပါပြီး။ အခုချိန်မှာဆိုမားကတ်စ်ကလည်း အဘိုးဖြစ်လာပြီး အငြိမ်းစားယူဖို့ဆုံးဖြတ်လိုက်ပါပြီ။ မိုက်ခ် (ဝယ်လ်စမစ်) တော့ လူပျိုကြီးအဖြစ်သေတဲ့အထိ လူဆိုးဖမ်းချင်နေတုန်းပါပဲ။ ဒါပေမယ့် သူတို့ရဲ့အတိတ်က ရန်ငြိုးက သူတို့ကို အေးအေးဆေးဆေးအနားယူခွင့်မပေးလာပါဘူး။ မိုက်ခ် နဲ့အတူ တရားသူကြီး၊ရှေ့နေ၊သတင်းပေး၊ ရဲအရာရှိ စတဲ့သူတွေအကုန် လုပ်ကြံခံလာရပါတယ်။ ဒီတော့ နောက်ဆုံးမှာ Bad Boys ကြီးနှစ်ယောက် နောက်ဆုံးအကြိမ်အဖြစ် ဆိုးကြ ကြမ်းကြပါတော့တယ်။ဇာတ်လမ်းရယ် အက်ရှင်တွေရယ် အကုန်အဆင်ပြေတာမို့ ကြည့်ရတာ ကျေနပ်ကြမှာပါ။",
	downloadlink : "",	
	watchlink : "",
	name : "Bad boys for life (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/9/90/Bad_Boys_for_Life_poster.jpg"
},
{
	review : "တရုတ်အမျိုးသမီးသူရဲကောင်းတစ်ယောက်အကြောင်းကိုအခြေခံပြီးရိုက်ကူးထားတဲ့ မူလန်ဇာတ်ကားဟာ 1998 ကထွက်ရှိထားခဲ့တဲ့Walt Disney က Mulan Animation ဇာတ်ကားနဲ့မတူတဲ့ဖန်တီးချက်တွေနဲ့ တင်ဆက်ထားတာပါ။…နေမကောင်းတဲ့နေတဲ့ဖခင်ရဲ့ကိုယ်စားအတွက် သမီးဖြစ်သူဟွားမူလန်က စစ်မှုထမ်းဖို့အတွက်ယောကျာၤးလေးအယောင်ဆောင်ပြီးစစ်ထဲကိုဝင်ခဲ့ရပါတယ်…ကိုယ်ခံအားကောင်းပြီး တိုက်ရည်ခိုက်ရည်ရှိတဲ့ မူလန်ဟာတပ်ကိုဦးဆောင်နိုင်ရုံမကပဲတရုတ်သမိုင်းတစ်လျောက်မှာအကျော်ကြားဆုံး မိန်းကလေးစစ်သူကြီးတစ်ယောက်ဖြစ်လာခဲ့ရပါတယ်…တိုက်ပွဲတိုင်းမှာအောင်နိုင်ခဲ့ပေမယ့် ပင်ကိုယ်အခံကမိန်းကလေးဖြစ်နေသောကြောင့် သနားကြင်နာတတ်တဲ့စိတ်နဲ့အကြောက်တရားဟာ သူမအတွက်အားနည်းချက်တစ်ခုလိုဖြစ်လာခဲ့ရပါတယ်…တစ်ခုသောတိုက်ပွဲမှာသူမအားထားရတဲ့ ညီအစ်ကိုတွေကိုဆုံးရှုံးလိုက်ရတဲ့အခါသူမအတွက်အကြီးမားဆုံးထိုးနှက်ချက်တစ်ခုလိုဖြစ်လာခဲ့ရပါတော့တယ်…ဒီကားရဲ့ အဓိကဇာတ်ကောင် မူလန်နေရာမှာ တရုတ်နိုင်ငံရဲ့နာမည်ကြီးမင်းသမီးတစ်ဦးဖြစ်တဲ့ Zhao Wei ကသရုပ်ဆောင်ထားပါတယ်…ဒီဇာတ်ကားနဲ့ မင်းသမီး Zhao Wei ဟာ10th Changchun Film Festival : Actress Award300th Hundred Flowers Award : Best Picture Award & Best Actress Award19th Shanghai Film Critics Award : Best Actress AwardVietnam DAN Movie Awards : Favorite Actress Awardစတဲ့ဆုတို့ကို ရရှိခဲ့ပါတယ်…Rating 6.8 ရရှိထားပြီး တရုတ်နိုင်ငံအမျိုးသမီးစစ်သူကြီးတစ်ယောက်အကြောင်းကို ရိုက်ကူးထားတဲ့Mulan 2009 ဟာတရုတ်ပြည်သူများအပြင်တခြားနိုင်ငံကလူများကပါအထူးနှစ်သက်ခဲ့ကြတဲ့တရုတ်အက်ရှင်ကားကောင်းတစ်ခုအဖြစ်ရပ်တည်နိုင်ခဲ့ပါတယ်….။",
	downloadlink : "",
	watchlink : "",
	name : "Mulan (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/1/17/Mulan_%282020_film%29_poster.jpg/220px-Mulan_%282020_film%29_poster.jpg"
},

{
	review : "DCEU ရဲ့ လေးကားမြောက် ရုပ်ရှင် ဖြစ်တဲ့ Wonder Woman ရုပ်ရှင်ပါ။Box Office မှာ နံပါတ်တစ်ချိတ်ခဲ့ပြီး ဝေဖန်ရေးဆရာတွေရဲ့ ချီးကျူးမှုတွေနဲ့ ပရိသတ်တွေ အားပေးမှုအပြည့်ရထားပါတယ်။သူ့ကိုတော့ Batman vs Superman မှာ မြင်ဖူးခဲ့ပြီးသားဖြစ်မှာပါ။ဒီရုပ်ရှင်ထဲမှာတော့ ဒိုင်ယာနာ ရဲ့ ငယ်ဘဝနဲ့ လူ့လောကထဲကို ပထမဆုံးခြေချချိန် စွန့်စားခန်းတွေကို တွေ့ရပါလိမ့်မယ်။ဇာတ်လမ်းအကျဉ်းမှာတော့ ဒိုင်ယာနာဟာ လူတွေသာမာန်မျက်စိနဲ့ မမြင်နိုင်တဲ့ ကျွန်းတစ်ကျွန်းမှာ နတ်ဘုရားတွေဖန်ဆင်းထားတဲ့ အမေဇုံလို့ခေါ်တဲ့ စစ်သည်တော်တွေလက်ထဲမှာ မွေးဖွားကြီးပြင်းလာသူပါ။ဒိုင်ယာနာဟာ ဘုရင်မ ဟစ်ပိုလီတာရဲ့ သမီးတော်လည်း ဖြစ်ပါတယ်။အဲဒီကျွန်းမှာ ယောကျာ်းတစ်ယောက်မှ မရှိပါဘူး။တစ်နေ့မှာတော့ပထမကမ္ဘာစစ်ထဲက လေယာဉ်မှုးတစ်ယောက် လေယာဉ်ပျက်ကျပြီး ပင်လယ်ထဲ ပြုတ်ကျလာတာကို ကယ်တင်မိပြီး ကမ္ဘာစစ်ကြီးအကြောင်းကို ပထမဆုံးကြားသိသွားပါတော့တယ်။အမေဇုံတွေဟာ ကမ္ဘာကြီးကို စစ်နတ်ဘုရားလက်က ကယ်တင်ဖို့လို့ ယုံကြည်ထားတဲ့ ဒိုင်ယာနာဟာ လေယာဉ်မှုး ဗိုလ်ကြီး စတိ ထရီဗာနဲ့အတူ လူတွေရဲ့ လောကကြီးထဲကို ခြေချပြီး စစ်ပွဲကြီးတစ်ခုလုံးကို သူယုံကြည်သလို ရပ်တန့်ဖို့ကြိုးစားပါတော့တယ်။(ဘာသာပြန်သူကတော့ Littleneo ဖြစ်ပါတယ်)",
	downloadlink : "",
	watchlink : "",
	name : "Wonder woman 84 (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Wonder_Woman_1984_poster.jpg/220px-Wonder_Woman_1984_poster.jpg"
	
},

{
	review : "IP Man ရဲ့ 4 ကားမြောက်ဇာတ်ကားဖြစ်သလို နောက်ဆုံးကားလည်းဖြစ်ပါတယ်တကယ်ကိုကောင်းလွန်းတဲ့ကောင်းပါပဲ.သိုင်းချစ်သူတွေကိုတော့အထွေအထူးအများကြီးညွှန်းနေစရာတောင်မလိုဘူးထင်ပါတယ်။ ဒီဇာတ်ကားမှာတော့IP Man ဟာ သူ့ရဲ့အမျိုးသမီးသေဆုံးပြီးတဲ့နောက်ကျန်ခဲ့တဲ့သားငယ်ကိုတစ်ယောက်တည်းထိန်းကျောင်းခဲ့ရတယ်သားဖြစ်သူကလည်း အဖေဗီဇအတိုင်းပဲ သိုင်းကိုအရူးအမူးဝါသနာပါပေမယ့်IP Man က မသင်ပေးခဲ့ပါဘူး..ဒီတော့ရန်တွေခဏခဏဖြစ်ကျောင်းထွက်ရတော့သားဖြစ်သူအတွက် သင့်တော်မယ့်ကျောင်းကို ရှာဖို့အတွက်IP Man တစ်ယောက် အမေရိနိုင်ငံ ဆန်ဖရန်စစ်စကို မြို့ကိုခရီးဆန့်ရပါတော့တယ်အဲ့မှာ သူ့တပည့်ရင်းတစ်ယောက်ဖြစ်တဲ့ Bruce Lee နဲ့ပြန်လည်ဆုံတွေ့ပါတယ်အဲ့ဒီနောက်ဘယ်လိုတွေဆက်ဖြစ်မယ်ဆိုတာ ကိုယ်တိုင်သာဆက်လက်ခံစားကြပါဒီကားမှာ Bruce Lee ကို ရိုက်ကူးထားတာလည်း ကျွန်တော်သဘောကျမိပါတယ်",
	downloadlink : "",
	watchlink : "",
	name : "Ip Man 4: The Finale (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/5/5d/Ip_Man_4_poster.png/220px-Ip_Man_4_poster.png"
},

{
	review : "ဗန်ဒီဇယ်ကြီးရဲ့ အက်ရှင်ဇာတ်ကားအသစ် ထွက်လာပါတယ်။ဒီဇာတ်လမ်းကတော့သိပ္ပံစိတ်ကူးယဉ်လို့ ပြောရမှာပ။ဗန်ဒီဇယ်ဟာ အမေရိကန်စစ်တပ်ရဲ့ အထူးတပ်ဖွဲ့ဝင်တစ်ယောက်။ထုံးစံအတိုင်းပဲ စစ်ဆင်ရေးတွေမှာ အလွန်တော်တဲ့ ဆရာကြီးပေါ့။တစ်နေ့မှာတော့ လူတစ်ယောက်ကသူ့ရဲ့ ဇနီးကိုသူ့ရှေ့မှာတင် သတ်ပြီး သူ့ကိုပါ ပစ်သတ်သွားခဲ့တယ်။ဒါပေမယ့်သိပ္ပံပညာရှင်တစ်ယောက်ရဲ့ကျေးဇူးကြောင့် ပြန်ရှင်သန်လာပြီး ပိုသန်မာတဲ့၊ဒဏ်ရာတွေအလိုလိုကောင်းလာတဲ့စက်ရုပ်တစ်ပိုင်း လူသားတစ်ယောက် ဖြစ်လာပါတော့တယ်။ဒါပေမယ့် သူနိုးထလာချိန်မှာ သူ့ရဲ့အတိတ်ကို ရုတ်တရက်မမှတ်မိပါဘူး။အဲဒီနောက်မှ ဘာတွေဆက်ဖြစ်မလဲ ကြည့်လိုက်ပါ။ဇာတ်လမ်းနဲ့ အက်ရှင်ခန်းတွေ မဆိုးတာမို့ ကြိုက်ကြမယ်ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Bloodshot (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/4/45/Bloodshot_-_official_film_poster.jpeg"
},

{
	review : "သူ့အပေါ်မှာ အသက်ပေါင်းများစွာ မူတည်နေတယ်….ဘာလို့ဆို ခရီးစဉ်မှာရန်သူ့ ဂျာမန် U-boatတွေ ရေငုတ်သဘေ်ာတွေဟာ သေမင်းတွေလို့ သူတို့ကိုဇီဝိန်ချွေဖို့စောင့်နေလို့ပါပဲ….ခရီးစဉ်စကထဲက ရန်သူတွေဟာ Greyhound ကြီးနဲ့မဟာမိတ်သဘေ်ာတွေကို အမဲလိုက်သလို တဝုန်းဝုန်းစစ်မျက်နှာဖွင့်ပါတယ်…ကပ္ပတိန် Ernest Krause တစ်ယောက် ဘယ်လိုတွေရင်ဆိုင်သွားမလဲဆိုတာကိုတော့….ဒီရုပ်ရှင်ကားကြီးဟာ C.S Foresterရဲ့ 1955 ခုနှစ်ကထုတ်ဝေတဲ့ The Good Shepherd ကိုအခြေခံထားပြီးCaptain ရဲ့နေရာမှာတော့ အားလုံးရဲ့အချစ်တော်မင်းသားကြီး Tom Hanks ကသရုပ်ဆောင်ထားပါတယ်… စစ်ပွဲရဲ့အလယ်မှာ ရရှိတဲ့ အချက်အလက်တွေမူတည်ပြီးစက္ကန့်ပိုင်းအတွင်း မှန်ကန်တဲ့ အမိန့်ကိုပေးဖို့က တကယ့်ကိုမလွယ်ပါဘူး…တစ်ချက်လောက်မှားလိုက်တာနဲ့အားလုံးအသက်ပျောက်သွားတဲ့အပြင် သူစောင့်ရှောက်တဲ့ သဘေ်ာတွေလည်း အလွယ်တစ်ကူဆုံးရှုံးရမှာမို့တာဝန်က ကြီးလွန်းလှပါတယ်….ဒီရုပ်ရှင်ဟာ battle scene တွေက ဇာတ်လမ်းစပြီးကို မကြာဘူးဝုန်းဂျိန်းနဲ့ကိုတွယ်တာပါ…ကြည့်ရှုသူ ကိုယ်တိုင် ကပ္ပတိန် Ernest Krause  နေရာကိုရောက်သွားပြီးမွန်းကြတ်လာပါလိမ့်မယ်…ခံစားကြည့်ကြပါဉီး….",
	downloadlink : "",
	watchlink : "",
	name : "Greyhound (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Greyhound_poster.jpeg/220px-Greyhound_poster.jpeg"
},

{
	review : "ဖခင်ဖြစ်သူဟာ လူဆိုးတွေနဲ့ပတ်သက်မိပြီး သေဆုံးခဲ့လို့ ၉နှစ်အရွယ်သမီးလေးဟာအမေနဲ့ပဲကျန်ခဲ့လေရဲ့…ဒီမိသားစုဟာ လူသတ်တရားခံနဲ့ ပတ်သက်နိုင်လို့ဆိုပြီးစုံထောက်အဖွဲ့ဟာ ဒီကလေးမလေးရဲ့အိမ်ကို ၂၄နာရီစောင့်ကြည့်ပါတယ်…စောင့်ကြည့်အဖွဲ့ခေါင်းဆောင်က စီအိုင်အေက လူကြမ်းအေးဂျင့်ကြီးတစ်ယောက်ဖြစ်ပါတယ်….စီအိုင်အေရဲ့ အဆင့်မြင့်ထောက်လှမ်းမှုတွေကို ထက်မြက်တဲ့ကောင်မလေးဟာသိသွားခဲ့တယ်…ဒီကလေးမလေးဟာ ဒီအတိုင်းတော့မနေဘူး..စီအိုင်အေထောက်လှမ်းရေးအဖွဲ့ကို တုန့်ပြန်ဖို့အကွက်လေးတွေဆင်ပါတော့တယ်..အေးဂျင့်ကြီးဒီကလေးကြောင့်တိုင်တွေပတ်တဲ့အပြင် လူဆိုးအဖွဲ့ကလည်း တစ်ချိန်ထဲပေါ်လာတဲ့အချိန်မှာတော့…ကလေးမလေးက ဘယ်လိုတွေလုပ်လဲ…မိသားစုနဲ့ လူဆိုးအဖွဲ့ကရော ဘယ်လိုတွေဆက်နွယ်မှုရှိနေတာလဲ…တကယ်အမှုကြီး ရုပ်လုံးပေါ်လာချိန်မှာ အေးဂျင့်ကြီးနဲ့ကလေးမလေးက ဘယ်လိုတွေရင်ဆိုင်ကြမလဲ…ဒီဇာတ်လမ်းက ရယ်လည်းရယ်ရသလို အက်ရှင်ခန်းခပ်မိုက်မိုက်တွေလည်း ပါပါတယ်..မိသားစုနဲ့အတူကြည့်လို့ရသလိုရင်ခုန်စိတ်လှုပ်ရှားဖွယ်လည်းကောင်းပါတယ်…အေးဂျင့်ကြီးအဖြစ်တော့နပမ်းမင်းသားလို့အားလုံးတော်တော်များများခေါ်ကြတဲ့ ဘက်တစ်စတာကသရုပ်ဆောင်ထားပါတယ်..",
	downloadlink : "",
	watchlink : "",
	name : "My spy (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/2/26/My_Spy_poster.jpg/220px-My_Spy_poster.jpg"
},

{
	review : "အားလုံးကြည့်ချင်ကြမယ့် သိပ္ပံစိတ်ကူးယဉ် ဟော်ရာ ရုပ်ရှင်တစ်ခု တင်ပေးထားပါတယ်။ မင်းသမီး ခရစ္စတင်း စတီးဝပ်အဓိက ပါဝင်ထားပါတယ်။ Survival ကားလို့လည်း ပြောလို့ရပါတယ်။ ဇာတ်လမ်းအကျဉ်းကတော့ ဟိုး သမုဒ္ဒရာကြမ်းပြင်က စခန်းတစ်ခုမှာ နေတဲ့ သိပ္ပံပညာရှင် တစ်စုဟာ သူတို့ရဲ့ စခန်းကြီး ငလျင်ကြောင့် ပျက်စီးချိန်မှာ အသက်ရှင်ဖို့ကြိုးစားကြရပါတယ်။ သူတို့အတွက် ရေအောက်က အပျက်အစီးတွေ ထွက်ဖို့ခက်တာတွေနဲ့တင် မလုံလောက်ခဲ့ပါဘူး။သမုဒ္ဒရာကြမ်းပြင်အောက်အနက်ထဲအထိ တူးဖော်ကြတဲ့အကျိုးဆက်အနေနဲ့ ကြောက်စရာ သတ္တဝါဆန်းတွေ ထွက်ပေါ်လာခဲ့တာပါ။ ဒီအန္တရာယ်မျိုးစုံကနေ အလွတ်ရုန်းဖို့ ကြိုးစားကြတဲ့ပုံကိုကြည့်ရမှာဖြစ်လို့ ဒီလိုရုပ်ရှင်အမျိုးအစားတွေကိုကြိုက်တဲ့သူတွေကြည့်သင့်တဲ့ ကားပါပဲ။",
	downloadlink : "",
	watchlink : "",
	name : "Underwater (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Underwater_poster.jpeg/220px-Underwater_poster.jpeg"
},

{
	review : "စနိုက်ပါဇာတ်လမ်း၊ အက်ရှင်ဇာတ်လမ်းကြိုက်သူတွေအတွက် တင်ပေးထားပါတယ်။ဇာတ်လမ်းအကျဉ်းကတော့ အမေရိကန် နိုင်ငံမှာအခြားနိုင်ငံက ဝန်ကြီးတစ်ယောက်စနိုက်ပါနဲ့ အပစ်ခံလိုက်ရပါတယ်။အဲဒီ ပစ်တဲ့သူဘယ်သူလဲဆိုတာ သဲလွန်စတွေအရစုံစမ်းတော့ ဘက်ကက် ဆိုတဲ့ လက်ဖြောင့်တပ်သားတပ်ကြပ်ကြီး တစ်ယောက် ဖြစ်နေတာကိုတွေ့ရတာပါပဲ။ဒါပေမယ့် ဘက်ကက်က ချောက်တွန်းခံရတာဖြစ်ပြီး သူ့ကိုဖမ်းထားတုန်းမှာပဲ နှုတ်ပိတ်ဖို့ကြိုးစားလာပါတယ်။ဒီတော့ သူ့အဖေရယ်၊ ထောက်လှမ်းရေး အေးဂျင့်တစ်ယောက်ရယ်အကူအညီနဲ့ တရားခံအစစ်ကိုလိုက်ရှာပြီး အမှန်ကိုပေါ်လာအောင် ကြိုးစားရပါတော့တယ်။",
	downloadlink : "https://lolburmese.github.io/ml1.mp4",
	watchlink : "ml1.mp4",
	name : "Sniper: Assassin’s End (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/5/51/Sniper-_Assassin%27s_End_poster.jpg/220px-Sniper-_Assassin%27s_End_poster.jpg"
},

{
	review : `လွန်ခဲ့တဲ့နှစ်ပေါင်း ၈၀၀ လောက်က လူသား
တွေ ကသူတို့ဖာသာ အိုးအိမ်တွေမြို့သစ်
တွေတည်ပြီး စည်ပင်ထွန်းကားခဲ့ကြတယ်
တန်ခိုးသြဇာ ကြီးမားခဲ့ကြတယ် ဒါပေမယ့်
သူတို့ မေ့လျော့နေခဲ့တာက မွေးရာပါပါရမီ
ထူးပါလာပြီး ဆရာ မလို လမ်းကြောင်းမယ့်
သူမလိုပဲအောက်လမ်းပညာတွေမှော်အတတ်
အစီမံတွေ ကျွမ်းကျင်နေတဲ့ လူတစ်စုပဲ
တစ်နည်းအားဖြင့် စုန်းတွေပေါ့ စုန်းတွေနဲ့ လူ
တွေကြားက ပဋိပက္ခတွေဟာအချိန်နဲ့အမျှ
လှိုက်စားကြီးထွားလာတယ် အမုန်းအာဃာ
တတွေကလဲ လမ်းဆုံးမရှိတဲ့ခရီးလမ်းလို
များပြားထွေလီရှည်လျားခဲ့တယ် ဒီလိုနဲ့
သေမြေကြီးရှင်ရွှေထီးဆိုပြီး ထင်ရာစိုင်း
တဲ့ဗိုက်ကင်းတွေ မိမိတိုင်းပြည်လူမျိုးအတွက်
အသက်စွန့်တိုက်ခိုက်မယ့်ရဲရဲတောက်
သူရဲကောင်းတွေ သူတို့ အသက်ကအရေး
မပါဘူူး သူတို့မှာဖက်တွယ်စရာအိုးအိမ်
တွေလဲ မရှိရှာတော့ဘူူး ဒီကြမ္မာငင်ဇာတ်
လမ်းဆိုးကို ပြန်နားထောင်ပေးမယ့်သားမြေး
မြစ်တွေလဲ မရှိတော့တဲ့အချိန် ရော်ရင့်နေတဲ့
သစ်ပင်အိုကြီး မကောင်းမှုတို့ အလုံးစုံအတိ
ပြီးတဲ့ စုန်းအသိုက်မြုံထဲ ချဉ်းနင်းဝင်ရောက်
ကြတယ် ဗင်ဒီဇယ် တဖြစ်လဲ ကော်ဒါ ဦး
ဆောင်တဲ့ တပ်စုလေး အောက်လမ်းစုန်း
တွေရဲ့ ခြောက်ခြားမှုတွေအောက်မှာသွေး
မပျက်အောင်ကြိုးစားထိန်းနေရတယ်တစ်ယောက်ပြီးတစ်ယောက် တစ်သက်ပြီး
တစ်သက်ပေးဆပ်လိုက်ရတဲ့ သွေးသောက်
ညီကိုတွေကိုကြည့်ပြီး သံထည်နဲ့မီးတောက်
အားကို ပြု ပီး ကော်ဒါတစ်ယောက်
မိစ္ဆာမရင်ဝကို ဒီလူမျိုးတုန်းသတ်ဖြတ်တဲ့
ပုလိပ်ရောဂါကပ်ဆိုးကြီးဖန်တီးရှင်ရဲ့ အသဲ
အူတည့်တည့်ကို အမုန်းဓားတစ်ဆင်းထိုး
စိုက်လိုက်နိုင်ခဲ့တယ်
စုန်းဘုရင်မကြီး နိဌိတံပြီး ပုလိပ်ရောဂါဆိုး
ကြီးလဲ ချုပ်ငြိမ်းပြီ ဒါပေမယ့် ဘယ်သူမှ
မမျှော်လင့်တဲ့အခိုက်အတန့်လေးမှာ လျှပ်ခနဲ
ဆိုသလိုကျိန်စာတစ်ခု အထမြောက်သွားခဲ့
တယ် ကိုယ်ချစ်တဲ့သူတွေသေတာထိုင်ကြည့်
ရတဲ့ကျိန်စာ နှစ်ပရိစ္ဆေဒကြာညောင်းတဲ့
အထိ ဒီကမ္ဘာပေါ်မှာချေချနေရတဲ့ကျိန်စာ
မိမိသမီးလေးအတွက် ချစ်ကြင်သူဇနီးမယား
အတွက် လက်စားချေတဲ့ ဒီကော်ဒါဆိုတဲ့
ဗိုက်ကင်းကြီး တစ်နည်းအားဖြင့် နောက်ဆုံး
ကျန်ရစ်ခဲ့တဲ့စုန်းလိုက်မုဆိုးကြီးကို အရိပ်
တစ္ဆေလို ကပ်ပါသွားခဲ့တယ်ဒီလိုကားမျိုးဆိုတာ ဝေဖန်ရေးနဲ့လေကန်ရေး
လုပ်ပြီးကြည့်ရမယ့်ကားလို့မထင်မိပါဘူး
မြှုပ်ကွက်လေးတွေတော့ရှိပေမယ့် သြချ
ရလောက်အောင်မပြောင်မြောက်ဘူး
ရွက်ကြမ်းရေကျိုအဆင့်လို့လဲပြောလို့မရ
ဘူး အက်ရှင် scene တွေလန်းတယ်
ဗင်ဒီဇယ်ကြီးကို ဗိုက်ကင်းလိုပုံဖော်ထား
တာမိုက်တယ် ကြည့်ရတာ အရသာရှိတယ်
effect တွေကောင်းတယ် ကျန်တဲ့ကျန်တဲ့
ဝေဖန်ရမယ့်အပိုင်းတွေကတော့ rating
ကိုကြည့်ပြီး ဆုံးဖြတ်နိုင်ပါတယ်`,
	downloadlink : "",
	watchlink : "",
	name : "The Last Witch Hunter (2015)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/8/8f/The_Last_Witch_Hunter_poster.jpg/220px-The_Last_Witch_Hunter_poster.jpg"
}



];



var adventurearray = [

{
	review : `ဒီတစ်ခါတော့ Tom Cruise ရဲ့ Sci-Fi Action ဇာတ်ကားကောင်း တစ်ကားနဲ့ မိတ်ဆက်ပေးချင်ပါတယ်။ ၂၀၁၄ ရဲ့ ဇာတ်ကားကောင်း တွေထဲမှာ တစ်ကားအပါအဝင်ဖြစ်ပြီး ပရိတ်သတ် ကြိုက်နှစ်သက်မယ်လို့ ထင်ပါတယ်။ဇာတ်လမ်းကတော့ ဥရောပမှာ အမှတ်မထင်ပဲ အာကာသ ထဲက နေ ဂြိုလ်သားတွေရောက်လာတာက စတင်ပါတယ်။ ပြင်သစ်၊ ဂျာမဏီ၊ ချက်၊ အီတလီ၊ပိုလန် စတဲ့ နိုင်ငံတွေ ကျသွားပြီးနောက် အနောက်ဖက်မှာ အင်္ဂလန်နဲ့ အရှေ့ဖက်မှာ ရုရှားတို့ လောက်ပဲ ကျန်တော့ပါတယ်။ ငါးနှစ်အတွင်းမှာ စစ်ပွဲအချို့ ပြန်နိုင်လာသလို၊ ဂြိုလ်သားတွေကို နှိမ်နင်းဖို့ Armor တွေလည်း တီထွင်ခဲ့ပါတယ်။ ဒီလိုနဲ့ East ဖက်က ရုရှား နဲ့ တရုတ်၊ West ဖက်က အမေရိကန်နဲ့ ကျန် Allied တွေက ထိုးစစ်စင်ခဲ့ပြီး၊ နောက်ဆုံး စစ်ပွဲကို ရောက်လာပါတယ်။
ဒီအချိန်မှာ Tom Cruise က စစ်ပွဲမှာ အဓိက ကျတဲ့ General နဲ့ တွေ့ဖို့ လန်ဒန်ကိုရောက်လာခဲ့ပါတယ်။ ဒါပေမယ့် အမှတ်မထင်ပဲ Tom Cruise ကို စစ်ပွဲမှာ ပါဝင်ဖို့ ပြောတဲ့အခါမှာတော့ Tom Cruise က စစ်ပွဲအတွေ့အကြုံ လုံးဝမရှိသလို၊ သူက တစ်ခါမှာလည်း စစ်မတိုက်ဖူးပါဘူး။ ဒါကြောင့် သူက ငြင်းဆန်ပေမယ့် နောက်ဆုံး ရာထူးချခံရပြီး၊ စစ်မှုထမ်းခဲ့ရပါတယ်။ တကယ်တမ်းတိုက်ပွဲမှာ တော့ ဂြိုလ်သားတွေကို လုံးဝမနိုင်ခဲ့ပါဘူး။ ဒါပေမယ့် Tom Cruise က မထင်မှတ်ပဲ သာမန် ဂြိုလ်သားတွေထက် အကောင်ကြီးတဲ့ ဂြိုလ်သားတစ်ကောင်ကို သတ်မိသွားပါတယ်။ အဲ့ဒီအချိန်မှာ အဲ့ဒီ ဂြိုလ်သားရဲ့သွေးက သူ့ကိုယ်ပေါ်ကို လာစင်ပြီးနောက် သူလည်း သေသွားခဲ့ပါတယ်။ဒီအချိန်မှာပဲ သူက ပထမဆုံး စစ်တပ်ထဲ စရောက်ခဲ့တဲ့ အချိန်ကို ပြန်ရောက်သွားပြီး၊ အဖြစ်အပျက်အားလုံးကိုလည်း မှတ်မိနေပါတယ်။ ဒီလိုနဲ့ သူသေသွားတိုင်း ဒီနေရာကပဲ ပြန်ပြန် စနေခဲ့ရာက၊ စစ်ပွဲထဲမှာ မင်းသမီး Emily Blunt ကို ကယ်တင်လိုက်တဲ့အခါမှာ သူမ ထံကနေ အကြောင်း စုံသိလိုက်ရပါတယ်။Tom Cruise ဖြစ်နေတာမျိုး တစ်ချိန်က သူမလည်းဖြစ်ခဲ့ဖူးတယ်လို့ Emily Blunt ကပြောပြပါတယ်။ အကြောင်းအရင်းက သူသတ်လိုက်တဲ့ ဂြိုလ်သားက ရှားရှားပါပါးတွေ့ရခဲပြီး တစ်ကောင် တစ်လေသာ ရှိတယ်လို့လည်းဆိုပါတယ်။ ဒီအကောင်ကို Alpha လို့ခေါ်ပြီး၊ ဂြိုလ်သားတွေကို Micmic လို့ခေါ်ပါတယ်။ သူတို့ကို ထိမ်းချုပ်တဲ့ Central Brain ကိုတော့ Omega လို့ခေါ်ပြီး၊ Omega က အချိန်ကို ထိမ်းချုပ်နိုင်စွမ်းရှိပါတယ်။Alpha တစ်ခါ သေတိုင်းမှာ အဲ့ဒီနေ့ကို ပြန်ပြီး Reset လုပ်လိုက်ပါတယ်။ ဒါပေမယ့် Alpha ရဲ့ Memory ကတော့ ပျက်မသွားပါဘူး။ Tom Cruise က Alpha ကို သတ်လိုက်တုန်းမှာ အမှတ်မထင်ပဲ Alpha ရဲ့ ပါဝါကို ရလိုက်ပါတယ်။ ဒါကြောင့် သူသေတိုင်းမှ နေ့က အသစ် ပြန်ပြန်စတာဖြစ်ပါတယ်။ ဒီနည်းနဲ့ Micmic တွေက ဂြိုလ်တွေကိုလိုက်သိမ်းနေတာဖြစ်ပါတယ်။ ဒါကြောင့်လည်း လူတွေက နောက်ဆုံး Battle ကို အနိုင်မရတာဖြစ်ပါတယ်။Emily ကလည်း ဒါမျိုးပါဝါရခဲ့ပေမယ့် သူမရဲ့ စွမ်းအားက ပျောက်သွားခဲ့ပါတယ်။ ဘာလို့လည်းဆိုတော့ တစ်ရက်မှာ စစ်ပွဲမှာ သူမက မသေပဲ သွေးထွက်လွန်သွားခဲ့ပြီး၊ ဆေးရုံရောက်သွားပါတယ်။ အဲ့ဒီအခါမှာ သူမ ရဲ့ ပါဝါလည်း ပျောက်သွားတာဖြစ်ပါတယ်။ စွမ်းအားက သွေးထဲမှာ ပဲရှိတာဖြစ်ပါတယ်။ဒါကြောင့် Tom Cruise အနေနဲ့ Reset လုပ်ချင်ရင် အသေခံရမှာဖြစ်ပါတယ်။ ဒီလိုနဲ့ သူ အကြိမ်ကြိမ် Reset ပြန်လုပ်ပြီး၊ Training တွေလုပ်၊ Omega ရဲ့ နေရာကို ရှာရင်းနဲ့ တစ်နေရာမှာ သူ ကျပ်ရိုက်သွားပါတယ်။သူက Emily Blunt နဲ့ သံယောဇဉ်ဖြစ်နေပြီး၊ အဲ့ဒီတစ်နေရာမှာ Emily Blunt ကအမြဲသေနေပါတယ်။ သူဘယ်လို့မှ ကယ်လို့မရပါဘူး။ ဒါကြောင့် သူသာ ရှေဆက်သွားပြီး Omega ကို သတ်လိုက်ရင် Emily က ပြန်ရှင်လာတော့မှာမဟုတ်ပါဘူး။ဇာတ်လမ်းက ဒီထက်အများကြီးပိုကောင်းပြီး၊ စိတ်ဝင်စားဖု့ိလည်းကောင်းပါတယ်။ ကျွန်တော်တို့ ငယ်ငယ်တုန်းက ဂိမ်းကစားသလိုပါပဲ၊ မနိုင်တဲ့ Stage ကို အကြိမ်ကြိမ်ပြန်ကစားသလိုပါပဲ။ ရန်သူတွေကလညး ဒီနေရာကပဲထွက်ထွက်လာသလို၊ ကိုယ်ကလည်း အကုန်လုံးကို မှတ်မိနေပါတယ်။ တစ်ခုပဲ ရှိတာက ပါဝါပိတ်လိုက်ရင် Check Point က နေပြန်စလို့မရတော့ပါဘူး။ ဂိမ်းထဲမှာက အစကနေ ပြန်ပြီး ဆော့လို့ရပေမယ့် ဒီမှာကတော့ No Reset ပါ။ဇာတ်ကားကောင်းတစ်ကားပါ။ မင်းသားမင်းသမီးကတော့ ဝါရင်နာမည်ကြီးသရုပ်ဆောင်တွေ ဆိုတော့ ပြောနေစရာတောင်မလိုပါဘူး။ ဇာတ်လမ်း ဇာတ်အိမ်လည်းကောင်းပြီး၊ ဇာတ်ကားတစ်ကားလုံးကောင်းပါတယ်။
ကြည့်ကိုကြည့်သင့်တဲ့ဇာတ်ကားကောင်းတစ်ကားပါ။ No Sex, No Nudity ပါ။`,
	downloadlink : "",
	watchlink : "",
	name : "Edge of Tomorrow (2014)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/f/f9/Edge_of_Tomorrow_Poster.jpg"
},
{
	review : `အားလုံးသိကြတဲ့ Jurassic World:Fallen Kingdom ဟာ စပိန်ဒါရိုက်တာ J.A Bayona က ရိုက်ကူးထားတာဖြစ်ပြီး စိတ်ကူးယာဉ်သိပ္ပံဇာတ်လမ်းတစ်ခုလည်းဖြစ်ပါတယ်….ဒီကားဟာ ဒိုင်နိုဆောတွေရဲ့အကြောင်းကို ရိုက်ကူးထားတဲ့Jurassic Park ဇာတ်လမ်းတွေရဲ့  ၅ ကားမြောက်ဖြစ်ပြီးတော့Jurassic World (2015) ရဲ့ နောက်ဆက်တွဲကားလည်းဖြစ်ပါတယ်…Rating 7.8 ရရှိထားတဲ့ကားတစ်ကားဖြစ်ပါတယ်…Jurassic World ပျက်စီးသွားပြီးသုံးနှစ်အကြာမှာထိုအပန်းဖြေစခန်းဆောက်လုပ်ထားတဲ့ ကျွန်းမှာမီးတောင်ပေါက်ကွဲမှု့ကြောင့်ဒိုင်နိုဆောများမျိုးတုန်းရတော့မယ့် အခြေနေကိုရောက်လာပါတယ်..
အစိုးရဘက်ကလည်း ပြည်သူတွေအတွက် ဒါကိုမျက်ကွယ်ပြုလိုက်ပေမယ့်ဒုတိယဒိုင်နိုဆောတွေမျိုးတုန်းတော့မယ့် အခြေနေကိုကယ်တင်မယ့်သူများပေါ်လာပါတယ်…ဒါကတော့ Jurassic World (2015) မှာစတင်ပါလာတဲ့Owen Grady နဲ့ Claire Dearing တို့ရဲ့ကယ်ဆယ်ရေးအစီစဉ်ပဲဖြစ်ပါတယ်..သူတို့ဖန်တီးထားခဲ့တဲ့ ဒိုင်နိုဆောများကို သူတို့ကိုယ်တိုင်ကယ်ဆယ်ရမှာဖြစ်ပြီးတော့ဒီဒိုင်နိုဆောတွေထဲမှာလည်း များပြားလှတဲ့ အရိုင်းကောင်တွေရှိနေတဲ့အတွက်သူတို့ဘယ်လိုကယ်ထုတ်ကြမလဲဆိုတာ စိတ်ဝင်စားစရာကောင်းပါတယ်….နောက်ပြီးတော့ Jurassic World (2015) မှာ T-Rex ရဲ့ Raptor DNA တွေစုပြီးပေါင်းစည်းထားတဲ့ မျိုးစပ်အကောင်တစ်ကောင်ပါဝင်ခဲ့သလို ဒီကားမှာလည်း မျိုးစပ်အကောင်တစ်ကောင်ပါဝင်လာမှာဖြစ်ပါတယ်…အဲဒီအကောင်ကိုတိုက်ခိုက်ဖို့အတွက်လေ့ကျင့်ပေးထားတာဖြစ်ပြီးတော့Raptor ရဲ့ DNA ကိုအခြေခံပြီး ဖန်တီးထားတဲ့အတွက်အသိဉာဏ်ကြွယ်ဝမှု့အပိုင်းမှာ လူနဲ့တန်းတူညီမျှပါတယ်…Jurassic World (2015) မှာ Raptor လေးကောင်ထဲက တစ်ကောင်တည်းသာကျန်ရစ်ခဲ့တဲ့ ဘလူး ဟာလည်း ဒီဇာတ်ကားမှာ အဓိကဇာတ်ကောင်အဖြစ်ပြန်လည်ပါဝင်လာမှာပါ…ဒီကားရဲ့ထူးခြားချက်ကတော့ အရင်Jurassic Park ကားတွေလိုမျိုးဒိုင်နိုဆောတွေရဲ့ရန်ကို ကာကွယ်ရတော့မှာမဟုတ်ပဲနဲ့တိရိစ္ဆာန်တွေမျိုးတုန်းပျောက်ကွယ်သွားမှာကြောက်တဲ့ လူတစ်စုရဲ့တတ်နိုင်သမျှကယ်ဆယ်ရေးဆောင်ရွက်တာတွေကိုခပ်မိုက်မိုက် ဖန်တီးမှု့အဆန်းများနဲ့ရိုက်ကူးတင်ဆက်ထားတာပဲဖြစ်ပါတယ်…ဒီဇာတ်ကားကို ရုံမှာသွားကြည့်တဲ့အခါ တချို့လူတွေအဖို့ဇဝေဇဝါတွေဖြစ်နေကြမှာဖြစ်ပြီးတော့ နားလည်ကြမှာလည်းမဟုတ်ပါဘူး…ဒါကြောင့် မြန်မာစာတန်းထိုးနဲ့ ကြည့်ပြီးဇာတ်ကားရဲ့သဘောသဘာဝကိုနားလည်အောင် အကောင်းဆုံးဘာသာပြန်တင်ဆက်ပေးလိုက်ပါတယ်…တကယ်ကောင်းတဲ့ ဇာတ်ကားတစ်ခုဖြစ်ပါတယ်….`,
	downloadlink : "https://www.thecmpage.com/?r=aHR0cDovL3RpbnlsaW5rLnJ1bi9OOUlCb1BGRA==",
	watchlink : "",
	name : "Jurassic world (2018)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/6/6e/Jurassic_World_poster.jpg"
},

{
	review : "2014 Novemberမှာ ထွက်ရှိခဲ့ပြီး…IMDbရဲ့Rating အများဆုံးဇာတ်ကားများထဲမှာလည်း တစ်ကားအပါအဝင်ပါ…ဒါရိုက်တာကလည်း Christopher Nolanဆိုမှတော့ အထွေအထူးညွှန်းနေစရာတောင် လိုမယ်မထင်မိပါဘူး…Visual Effectsyပိုင်းမှာ အော်စကာရရှိခဲ့ပြီး  အခြားဆု ၄၄ဆုနဲ့ ဆန်ကာတင် ၁၄၄ဆုစာရင်းဝင်ခဲ့ပါတယ်… 2014ရဲ့အကောင်းဆုံး ၁၀ကားထဲမှာ စာရင်းဝင်ခဲ့ပါတယ်…(Background musicတွေလည်း နားထောင်လို့ကောင်းလို့ နားထဲတောင်စွဲနေပါလိမ့်မယ်…ဇာတ်လမ်းနည်းနည်း ပြောပြရမယ်ဆိုရင်တော့…21ရာစု လယ် လောက်မှာ ကမ္ဘာပျက်ကိန်း ဆိုက်လုပြီ ဖြစ်တဲ့အတွက် နာဆာ ပိုင်းလော့ဟောင်း ကူးပါး ခမျာခြံစိုက်နေရာကနေ လူတွေအတွက်နေစရာ ဂြိုဟ်အသစ် ရှာဖွေရေး စစ်ဆင်ရေးထဲ ပါဝင်လိုက်ရရှာတယ်…၁၀နှစ်အရွယ် သမီးလေး မာ့ဖ် ကို တစ်နေ့ ပြန်လာပါ့မယ် ကတိအထပ်ထပ်ပေးရင်းပေါ့…ဒီလိုနဲ့ ပေးအပ်လိုက်တဲ့တာဝန်တွေကို ထမ်းဆောင်ရင်း…အာကာသ ကြီးရဲ့ လှည့်ကွက် အမျိုးမျိုးကိုအန်တုရင်းကူးပါးတစ်ယောက် မာ့ဖ်ဆီပြန်လာနိုင်ပါ့မလား…ကမ္ဘာကြီးကိုရော ကယ်တင်နိုင်ပါ့မလား…ဆိုတာကို…Visual Effectsကောင်းကောင်း ရှုစားကြရမှာဖြစ်ပါတယ်....ဒီကားအတွက်အညွှန်းတောင်ရေးမတင်သင့်ပါဘူး...ခမ်းနားလွန်းတဲ့ ဇာတ်ကားကြီးအတွက် ဝါကျတည်ဆောက်ပုံခပ်ညံညံအောက်မှာ  ဘောင်ကွပ်လိုက်သလိုဖြစ်သွားမှာစိုးရိမ်မိလို့ပါ..",
	downloadlink : "ktulogo.png",
	watchlink : "",
	name : "Interstellar (2014)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/b/bc/Interstellar_film_poster.jpg"
},

{
	review : `တစ်ခေတ်တစ်ချိန်က အောင်မြင်ခဲ့ပြီး ဆုပေါင်းများစွာအရယူထားနိုင်ခဲ့တဲ့ Marry Poppins (1964) ရဲ့ Sequal အဖြစ် အခု ၂၀၁၈ မှာMary Poppins’ Return ဆိုပြီး ပြန်လည်အသက်သွင်းခဲ့တဲ့ဇာတ်ကားဖြစ်ပါတယ်။Mary Poppins ဆိုတာ မှော်ဆရာမလေးတစ်ဦး၊ သူဘယ်ကလာလဲ၊ ဘယ်အချိန်ပေါ်လာမလဲ၊ ဘာကြောင့်မှော်အစွမ်းတွေရထားတာလဲဆိုတာတော့ဘယ်သူမှမသိပါဘူး။Mary Poppins’ Return အကြောင်းမပြောခင် Mary Poppins (1964) အကြောင်းလေးကနေစပြောမှ ဇာတ်ရေနည်းနည်းလည်ပါလိမ့်မယ်။Jane Banks နဲ့ Michael Banks တို့ငယ်ငယ်တုန်းက Mary Poppins က ကလေးထိန်းအဖြစ်နဲ့ စောင့်ရှောက်ပေးခဲ့ပါတယ်။အဲ့ဒီမောင်နှမနှစ်ယောက် အဖေဖြစ်သူနဲ့အဆင်ပြေပြေဖြစ်သွား၊ မိသားစုကိစ္စတွေလဲပြေပြေလည်လည်ဖြစ်သွားခဲ့တဲ့အချိန်မှာ Mary Poppins ကသူ့ရဲ့မူလနေရာလို့ဆိုရမယ့် လန်ဒန်မိုးကောင်းကင်ပေါ်ကို ပြန်သွားခဲ့ပါတယ်။
အဲ့အချိန်ကစပြီး Jane နဲ့ Michael တို့နှစ်ယောက် Mary Poppins ကိုပြန်မတွေ့တော့ပါဘူး။Mary Poppins နဲ့အတူ ကြုံတွေ့ခဲ့ရတဲ့ အထူးအဆန်းတွေ၊ စွန့်စားခန်းတွေက အိပ်မက်လိုလို စိတ်ကူးယဉ်မှုလိုလိုနဲ့ပဲ ထင်ယောင်ထင်မှားဖြစ်ကျန်ခဲ့ပါတယ်။အခုဒီ Mary Poppins’ Return မှာတော့ ဇာတ်ကားနာမည်အတိုင်းပဲ Mary Poppins ကောင်းကင်ပေါ်က ပြန်ဆင်းလာပါပြီ။Jane နဲ့ Michael လဲ လူကြီးအရွယ်ရောက်၊ Michael ဆို ကလေးသုံးယောက်တောင်ရနေပါပြီ။Michael က မိန်းမလဲဆုံးပါးသွားသလိုစီးပွားရေးအကြပ်အတည်းဖြစ်နေတာကြောင့် သူအလုပ်လုပ်တဲ့ဘဏ်မှာပဲ သူ့အိမ်ကို ပေါင်ထားခဲ့ပါတယ်။ဒါပေမယ့် အတိုးတွေမဆပ်နိုင်ဖြစ်လာတဲ့အခါအိမ်ကို ဘဏ်ကနေ သိမ်းယူတော့မယ့်အခြေအနေမျိုးဖြစ်လာပါတယ်။အဲ့အချိန်မှာပဲ Mary Poppins ကောင်းကင်ပေါ်ကဆင်းလာပြီးMichael ရဲ့ကလေးသုံးယောက်ကို စောင့်ရှောက်ပေးမယ့် ကလေးထိန်းအဖြစ် ပြန်လာခဲ့ပါတယ်။ဟိုးအရင်တုန်းကအတိုင်း Banks မိသားစုရဲ့အခက်အခဲတွေကို Mary Poppins တစ်ယောက် ကူညီဖြေရှင်းပေးဖို့အတွက်ရောက်လာခဲ့တာပဲဖြစ်ပါတယ်။ဒီဇာတ်ကားက Musical, Comedy, Family, Fantasy အမျိုးအစားဇာတ်ကားဖြစ်တာကြောင့် ပေါ့ပေါ့ပါးပါး မိသားစုနဲ့အတူကြည့်လို့ကောင်းမယ့်ဇာတ်ကားမျိုးလေးဖြစ်ပါတယ်။`,
	downloadlink : "",
	watchlink : "",
	name : "Mary Poppins Returns (2018)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/4/48/Mary_Poppins_Returns_%282018_film_poster%29.png"
},

{
	review : "Director George Miller ရဲ့ပြောဆိုချက်အရ နောက်ဇာတ်ကားအသစ်ရဲ့နာမည်သည် Mad Max: The Watseland ဖြစ်ပြီး မည့်သည့်အချိန်တွင် ထွက်ရှိမည်ကိုတော့ မပြောပြသွားပေ။ ဘာပဲဖြစ်ဖြစ်ပါ။ ယခု Fury Road ကဲ့သို့အဘက်ဘက်က အပြစ်ကင်း၍ အလွန်တရာ ကောင်းမွန်လှပြီး ကြည့်ပြီးသူတိုင်း အကြိုက်တွေ့ခဲ့ကြတဲ့ ဇာတ်ကားမျိုး Sequel ကို လူတိုင်းစောင့်မျှော် ကြည့်ရူချင်ကြမှာ အမှန်ပါပဲ။ ကျွန်တော်တို့မေးခဲ့သော လျှို့ဝှက်ချက်များကိုလည်း နောက်အသစ်ထွက်မဲ့ ရုပ်ရှင်များတွင် ဖြေရှင်းနိူင်ပါစေလို့ပဲ မျှော်လင့်ရင်း ဒီနှစ်ရဲ့အကောင်းဆုံး Action ဇာတ်ကား ကျွန်တော် ဒီနှစ်ကြည့်ဖူးသမျှရုပ်ရှင်တွေရဲ့အကြိုက်ဆုံး 4 ကားတွင် တစ်ကားအပါအဝင်ဖြစ်သော ယခု ဒီ Mad Max: Fury Road review ရှည်ကြီးကို ဒီမှာတင်ပဲ ရပ်နားခွင့် ပြုပါ။",
	downloadlink : "",
	watchlink : "",
	name : "Mad Max fury road (2015)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/6/6e/Mad_Max_Fury_Road.jpg"
},

{
	review : "“Crouching Tiger Hidden Dragon”သိုင်းကားကို ရိုက်ကူးခဲ့တဲ့ဒါရိုက်တာကို ရုပ်ရှင်ပရိသတ်အတော် များများသိကြမှာပါ။ဒီသိုင်းကားကိုရိုက်ကူးခဲ့တဲ့ ဒါရိုက်တာက Life of Pi ကိုရိုက်ကူးခဲ့တာသိရတော့“ရှော့ခ်”ဖြစ်သွားခဲ့ကြရတဲ့လူတွေထဲမှာ ကျွန်တော်လည်းပါဝင်ပါတယ်။ဟုတ်ပါတယ်။ထိုင်ဝမ်သား ဒါရိုက်တာ Ang Lee ပဲဖြစ် ပါတယ်။Ang Lee ရဲ့ Life of Pi ဇာတ်ကားဟာ အကယ်ဒမီဆု ၄ ဆုအထိရအောင် ဆွတ်ခူးခဲ့ပါတယ်။သူကိုယ်တိုင်လည်း အကောင်းဆုံးဒါရိုက်တာအကယ် ဒမီဆုရှိခဲ့ပါတယ်။IMDb သတ်မှတ်ချက် 7.9 ရရှိထားပါ တယ်။လူအတော်များများကို “Life of Pi ကြည့်ပြီးပြီလား”လို့ မေးကြည့်တဲ့အခါ “ကျားတစ်ကောင်နဲ့အတူပင်လယ်ထဲ မျောသွားတဲ့ကားမဟုတ်လား”လို့ပြန်ဖြေကြတာပိုများ ပါတယ်။ကျွန်တော်ပြောချင်တာက ဒီဇာတ်ကားဟာ အဲ့ဒီထက်အများကြီးပိုပါတယ်။ရုပ်ရှင်ဝေဖန်ရေးသမား များကြား အတော်ဂယက်ရိုက်ခဲ့တဲ့ ဇာတ်ကားလည်း ဖြစ်ပါတယ်။ဒီဇာတ်ကားကို ဝေဖန်ရေးဆရာများ ဝေဖန်ကြရာမှာ လောကီအမြင်နဲ့ဝေဖန်ကြသူများလည်းရှိသလို၊လော ကုတ္တရာအမြင်နဲ့ဝေဖန်ကြသူများလည်းရှိပါတယ်။ရုပ်ဝတ္ထုဝါဒီများ နဲ့ အတွင်းစိတ်သန္တာန်သည် သာအဓိကဟုယုံကြည်သူများကြားငြင်းခုန်ချင်စရာ ကောင်းတဲ့ ဇာတ်ကားလည်းဖြစ်ပါတယ်။ဝေဖန်ရေးဆရာများ အဓိကဝေဖန်ခဲ့ကြတဲ့ ဒိုင်ယာလော့အချို့ကိုဖော်ပြပေးလိုက်ပါတယ်။(၁)ဘုရားတစ်ပါးတည်းရှေ့မှာ အပြစ်ဝန်ခံတာထက် ဘုရားရှင်တွေအများကြီးရှေ့မှာအပြစ်ဝန်ခံတာက ပိုမကောင်းဘူးလား(၂)ဘာသာရေးဆိုတာ မှိုင်းတိုက်ထားတဲ့အမှောင်ခန်း ကြီးကွ(၃)ကျွန်တော်မျိုးအား ခရစ်တော်နှင့်မိတ်ဆက်ပေးတော်မူခဲ့တဲ့အတွက် ကျေးဇူးတင်ပါတယ်အရှင်ဗိဿနိုး (၄)နှစ်ပေါင်း ၁၀၀ လောက်အတွင်းမှာ စကြာဝဠာကြီး အကြောင်းကိုသိပ္ပံပညာကပြောပြနိုင်ခဲ့တာဟာ ဘာသာရေးတွေ နှစ်ပေါင်း ၁၀၀၀၀ လောက်ပြော ပြခဲ့တာထက် သာတယ်(၅)ရုပ်ဝတ္ထုလောကအကြောင်းကို သိပ္ပံပညာက သင်ကြားပေးနိုင်ပေမယ့်အတွင်းစိတ်သန္တာန်ထဲက အကြောင်းတွေကိုတော့သိပ္ပံပညာက မသင်ကြား ပေးနိုင်ပါဘူးဒီဇာတ်ကားရဲ့ ဇာတ်လမ်းအကျဉ်းကတော့ အိန္ဒိယမိသားစုတစ်စုဟာ ၎င်းတို့ပိုင်ဆိုင်တဲ့တိရိစ္ဆာန်ရုံ ကြီးထဲမှ တိရိစ္ဆာန်များကို ကနေဒါနိုင်ငံမှာရောင်းချဖို့ဂျပန်ကုန်တင်သင်္ဘောတစ်စီးနဲ့ပိစိဖိတ်သမုဒ္ဒရာကြီးကို ဖြတ်သန်းခဲ့ကြပါတယ်။ကမ္ဘာ့အနက်ဆုံး မာရီယာနာသမုဒ္ဒရာချောက်နက်ကြီး အပေါ်မှာ သင်္ဘောနစ်မြုပ်ခဲ့ပြီးသားငယ်”ပိုင်”၊ခွေးအ တစ်ကောင်၊မြင်းကျားတစ်ကောင်၊မျောက်ဝံတစ် ကောင်နဲ့ ဘင်္ဂလားကျားကြီးတစ်ကောင်တို့သာလျှင်အသက်ကယ်လှေပေါ်ရောက်ရှိပြီး လွတ်မြောက်ခဲ့ကြပါတယ်။ပိစိဖိတ်သမုဒ္ဒရာကြီးအလယ်မှာရက်အတော်ကြာ မျောပါနေခဲ့ပြီးနောက်ဆုံးမှာ ပိုင် နဲ့ ကျား နှစ်ဦးသာ ကျန်ခဲ့ပါတော့တယ်။ပင်လယ်ပြင်မှာ သင်္ဘောနစ်မြုပ်တဲ့ဇာတ်လမ်းဟာ အထူးအဆန်းတော့မဟုတ်ပါဘူး။ဒီဇာတ်လမ်းမှာ ထူးခြားတာက-ဘုရားသခင်ရဲ့ကယ်တင်ခြင်းခံခဲ့ရတယ်လို့” ပိုင်”က ယုံကြည်နေတယ်။-ကျားကြီးသာပါမလာရင် သူအသက်ရှင်လွတ်မြောက် နိုင်မှာမဟုတ်ဘူးလို့လည်းသူကယုံကြည်နေပါတယ်။ရုပ်ရှင်ပါးဝနေသော ပရိသတ်များက “ပေးချင်တဲ့ Message တွေအရမ်းကောင်းတယ်“သုံးသပ်ကြပေ မယ့် “ဘာ message တွေလဲ” လို့ပြန်မေးလျှင်အဖြေမပေးနိုင်ကြတာ ပိုများပါတယ်။Life of Pi ဟာ best visual effects နဲ့ best cinematographyဆုများကိုလည်း ရရှိထားတာ ကြောင့် ပင်လယ်ပြင်ရှုခင်းများလည်းအရမ်းကောင်းပါ တယ်။(wallpaper အဖြစ်အသုံးများကြသည်) ကျွန်တော့ Review ကို“အလွန်တွေရေးထားတာ”လို့ ထင်ကောင်းထင်မိကြပါလိမ့်မယ်။ဇာတ်ကားကို ကိုယ်တိုင်ကြည့်ပြီးမှသာ ကျွန်တော်ရဲ့ Review ဟာမလွန်ရုံသာမက လိုပင်လိုအပ်နေ သေးတယ်လို့ ထင်မြင်မိကြပါလိမ့်မယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Life of pi (2012)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/5/57/Life_of_Pi_2012_Poster.jpg"
},

{
	review : "ဒီတစ်ခေါက်part 3မှာတော့ part 1 နဲ့ part 2 မှာတုန်းကလိုအနာဂတ်ကိုပြန်သွားမှာမဟုတ်ဘဲ  back to the future 1 ရဲ့ဇာတ်သိမ်းခန်းနဲ့ချိတ်ဆက်ပြီးရိုက်ပြထားပါတယ်။မာတီနဲ့ဒေါက်တာတို့ရဲ့သံယောဇဉ်ကို ဒီအပိုင်း၃မှာ ပိုပြီးကွက်ကွက်ကွင်းကွင်းမြင်တွေ့ရမှာပါ။ကောင်းဘွိုင်ခေတ်မှာပိတ်မိနေခဲ့တဲ့ဒေါက်တာဟာ အသက်ရှည်ရှည်မနေရဘဲ အသတ်ခံလိုက်ရတဲ့အတွက် မာတီဟာ ဒေါက်တာ့ကိုကယ်ဖို့ အတိတ်ကိုခရီးလွှင့်လာပါတော့တယ်။ ကောင်းဘွိုင်ခေတ်စွန့်စားခန်းတွေနဲ့သိပ္ပံပေါင်းစက်ထားတဲ့ ဤဇာတ်ကားကိုပရိသတ်ကြီးအကြိုက်တွေ့စေမှာအမှန်ပါပဲခင်ဗျာ.. ဤpart 3 ကို part 1 နဲ့ part 2 ကိုကြည့်ပြီးကြည့်မှသာပိုသဘောပေါက်နိုင်မှာမို့ ပထမ၂ကားကိုအရင်ကြည့်ကြပါလို့တိုက်တွန်းလိုက်ပါတယ်ခင်ဗျာ.. ပရိသတ်ကြီးပေးလိုက်ရတဲ့အချိန်နဲ့တန်အောင်ရသမျိုးစုံပေးမယ့် ဇာတ်ကားကောင်းတစ်ကားဖြစ်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Back to the future 3 (1990)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/d/d2/Back_to_the_Future.jpg/220px-Back_to_the_Future.jpg"
},

{
	review : "ဒီတစ်ခါတော့ Superhero တွေထဲမှာ လူကြိုက်အများဆုံးလည်း ဖြစ်သလို၊ Superhero အားလုံးရဲ့ ရှေ့ဆောင် လမ်းပြလည်း အဖြစ် Superman နဲ့ အတူ သတ်မှတ်ခံထားရတဲ့ Batman ဇာတ်လမ်း နဲ့မိတ်ဆက်ပေးပါရစေ။The Dark Knight လို့တင်စားခံထားရတဲ့ Batman ကားတွေက ၁၉၈၉ မှာထဲက ရုပ်ရှင် အဖြစ်နဲ့ စင်မြင့်ထက်မှာ နေရာယူထားပေမယ့် ၂၀၀၅ ခုနှစ်ရောက် မှာ Christopher Nolan ရဲ့ Batman Begins နဲ့ အတူ လူရိုသေရှင်ရိုသေဖြစ်လာခဲ့ပါတယ်။ Batman လို့ပြောလိုက်ရင် Director Tim Burton ရဲ့ Batman (1989) Batman Returns (1992) တို့နဲ့ နာမည်ရလာပေမယ့်၊ Joel Schumacher ရဲ့ ကလေးကြိုက် Batman Forever နဲ့ ဘယ်သူမှမကြိုက်တဲ့ Batman & Robin (၁၉၉၇မှာထွက်ခဲ့ပြီး Batman ကို ရုပ်ရှင် လောက ကနေ ခဏတာကွယ်ပျောက်သွားစေပါတယ်။) ဒါပေမယ့် ၂၀၀၅ ခုနှစ်မှာ Batman Begins နဲ့အတူ Batman နဲ့ Comic Book ရုပ်ရှင်တွေ ရုပ်ရှင်လောကကိုတကျော့ပြန် ဝင်လာခဲ့ပြီး ၂၀၀၈ ခုနှစ် ရဲ့ The Dark Knight ကတော့ ဘယ်သူမှမငြင်းပယ်နိုင်တဲ့ အကောင်းဆုံး Batman ကားအဖြစ် ရပ်တည်နိုင်ခဲ့ပါတယ်။Batman Begins မှာ Gotham မြို့ကို ကယ်တင်ခဲ့ပြီးတဲ့နောက်မှာ Batman/Bruce Wayne အနေနဲ့ သူ့ရဲ့ အဆိုးဝါးဆုံး ရန်သူ ဖြစ်တဲ့ Joker နဲ့ ရင်ဆိုင်ရမှာဖြစ်ပါတယ်။ The Dark Knight ကားက Joker နဲ့ Batman ကို တမူထူးခြားတဲ့ ရှု့ထောင့်ကနေတင်ဆက်ထားပြီးတော့၊ Joker အဖြစ်သရုပ်ဆောင်တဲ့ Heath Ledger ကလည်း၊ လူတကာကို ဒုက္ခပေးဖို့က လွဲရင်၊ ဖျက်လိုဖျက်ဆီးလုပ်ဖို့ကလွဲရင် ဘာကိုမှ မလိုချင်တဲ့ ဇာတ်ရုပ်အဖြစ် ပီပြင်စွာသရုပ်ဆောင်ထားပါတယ်။ ဒီကားမှာ Joker က ပိုက်ဆံ၊ အာဏာ၊ ရာထူး ဘာကိုမှ မမက်ပဲ၊ ဖျက်လိုဖျက်ဆီးလုပ် ဖို့နဲ့ Gotham မြို့တစ်မြို့လုံးကို သူလိုပဲ လူဆိုး လူရမ်းကားတွေဖြစ် လာအောင် လုပ်ဖု့ိ ရည်ရွယ်ချက်နဲ့ လုပ်နေတာတွေကို တားဆီးဖို့ Batman အနေနဲ့ လုပ်ရိုးလုပ်စဉ် ထဲက နေခွဲထွက်ပြီး Joker ကို ဖမ်းဖို့ကြိုးစားရပုံကို တကယ့် စုံထောက်ကား ကောင်းတစ်ကား အနေနဲ့ တင်ဆက်ထားပါတယ်။Batman ရဲ့ Character မိတ်ဆက်ထဲမှာ ပြောထားသလိုပဲ Batman က Comic Hero တွေအားလုံးထဲမှာ The World Greatest Detective ဆိုတဲ့ ဘွဲ့ကိုရထားတဲ့ အတိုင်း ဒီကားမှာ သူ့ရဲ့ စုံထောက် စွမ်းရည်၊ ဉာဏ်ရည်ဉာဏ်သွေး သာမက သူ့ရဲ့ တိုက်ရည်ခိုက်ရည်၊ စွန့်လွှတ်စွန့်စား နိုင်မှုတွေ ကိုပါ ပရိတ်သတ် ကြီး ကြည့်ရှုခံစားနိုင်မှာပါ။ဒါ့အပြင် ဒီကားမှာ အဓိကသရုပ်ဆောင် Christian Bale ရဲ့ ပြီးပြည့်စုံတဲ့ Batman သရုပ်ဖော်မှု၊ ဒါရိုက်တာ ရဲ့ ရိုက်ကူးတင်ဆက်မှု၊ ထူးခြားတဲ့ ဇာတ်လမ်းဖွဲ့စည်းပုံ၊ နက်နဲတဲ့ ဇာတ်အိမ်တည်ဆောက်မှုတွေနဲ့ ကွင်းဆက်မိမိ တက်ဆက်ထားနိုင်မှုတွေထက် ပိုပြီး ပြောစရာတစ်ခုရှိပါတယ်။ ဒါကတော့ Heath Ledger ရဲ့ နောက်ဆုံး သရုပ်ဆောင်မှုလည်းဖြစ်သလို အကောင်းဆုံး ဇာတ်ကောင်လည်းဖြစ်တဲ့ Joker ပါ။ Heath Ledger ရဲ့ The Joker က တကမ္ဘာလုံးက ပရိတ်သတ်တွေကို တုန်လှုပ်စေခဲ့ပြီး၊ ဗီလိန် တွေထဲမှာ ဆရာတစ်ဆူဖြစ်စေခဲ့ပါတယ်။ ဒီကားက Batman ရဲ့အကောင်းဆုံးကားဆိုရင် Joker က အကောင်းဆုံး ဗီလိန် ဖြစ်ပါတယ်။ Heath Ledger လည်း ဒီကားနဲ့ အကယ်ဒမီရခဲ့ပါတယ်။၂၀၀၀ ပြည့်နှစ်နောက်ပိုင်း အကောင်းဆုံး အက်ရှင်ကားတွေထဲက တစ်ကားပါလို့ပြောလို့ရသလို၊ The Bourne Trilogy ထက်တောင် မှာ ပိုကောင်းတယ်ဆိုရင် ငြင်းမယ့်သူမရှိလောက်ပါဘူး။ ဒီကားက Batman Fan တွေနဲ့ Comic Book ပရိတ်သတ်တွေကို စိတ်ကျေနပ်မှု့အပြည့်အဝပေးနိုင်ပါတယ်။ တစ်ချို့နေရာတွေမှာ ဟာကွက် အနည်းငယ်ရှိပေမယ့် Batman, Gordon, The Joker နဲ့ Harvey Dent (Two Face) တို့ရဲ့ သရုပ်ဆောင် ကောင်းမှုတွေကြောင့် ဇာတ်လမ်းထဲမှာ မျောပါသွားပြီး ၂နာရီခွဲလုံး စိတ်လှုပ်ရှားစွာကြည့်ရမှာဖြစ်ပါတယ်။ ဝါရင့်သရုပ်ဆောင်ကြီးနှစ်ယောက်ဖြစ်တဲ့ Michael Caine နဲ့ Morgan Freeman တို့ကလည်း ဇာတ်လမ်းကိုပိုပြီး အသက်ဝင်စေပါတယ်။ဒီကားက ကလေးကြိုက် Batman ကားမဟုတ်သလို၊ ဖန်စီ အက်ရှင်ကားမဟုတ်ပါဘူး။ Crime/Action/Drama ကားဖြစ်ပြီး ကြည့်သင့်တဲ့ကားကောင်းတစ်ကားပါ။ မကြည့်ရသေးတဲ့သူတွေ ကြည့်ဖြစ်အောင် ကြည့်ဖို့ တိုက်တွန်းလိုက်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "The Dark Knight (2008)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/8/8a/Dark_Knight.jpg"
},

{
	review : "ဂျက်လီအားဖြည့်ပါဝင်ထားပြီး ရှေ့က Mummy နှစ်ကားရဲ့အဆက်အနေနဲ့ထွက်ရှိခဲ့တဲ့ ဇာတ်ကားဖြစ်ပါ။စွန့်စားရှာဖွေသူ အိုကောနယ်နဲ့သားဖြစ်သူတို့ဟာ အသက်ပြန်ရှင်လာတဲ့ ဟန်ဘုရင်ရဲ့ လက်စားချေမဲ့အစီအစဉ်တွေကိုရပ်တန့်ဖို့ကြိုးစားကြပါတယ်။ရက်စက်ကြမ်းကြုတ်တဲ့ ဟန်ဘုရင်ဟာ လူသားမျိုးနွယ်တခုလုံးကို ကျွန်ပြုဖို့ကြံစည်နေတာဖြစ်ပါတယ်…ဒါပေမဲ့ လွန်ခဲ့တဲ့ နှစ်2000က မှော်ဆရာမတဦးရဲ့ ကယ်တင်မှု့ကြောင့် ဟန်ဘုရင်နဲ့သူ့တပ်တခုလုံးဟာ ရွံ့ရုပ်တုများအသွင်ပြောင်းခဲ့ပါတယ်အခုအသက်ပြန်ဝင်လာတာကြောင့် ဟန်ဘုရင်ဟာ ဒီအစီအစဉ်ကို ပြန်အသက်သွင်းနေပါတယ်…ရစ်ခ်နဲ့သားတော်မောင်အဲလက်စ်ရောဟာ သဘာဝလွန်ကိစ္စများနဲ့ရင်းနှီးပြီးသားဖြစ်တာကြောင့်အကြောက်အလန့်မရှိတဲ့မိသားစုနဲ့ဟန်ဘုရင်စစ်တပ်တို့ ဘယ်လိုကြုံတွေ့မယ်ဆိုတာ…။",
	downloadlink : "",
	watchlink : "",
	name : "The Mummy 3 (2008)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/The_mummy.jpg/220px-The_mummy.jpg"
},

{
	review : "အားလုံးမျှော်လင့်နေတဲ့ ၂၀၂၀ ခုနှစ်ထွက် Doctor Dolittle ကိုတင်ဆက်ပေးလိုက်ပါတယ်…Dolittle ဟာ လွန်ခဲ့တဲ့ သက္ကရာဇ် ၁၉၂၀ ခုနှစ်မှာထွက်ရှိခဲ့တဲ့ စာရေးဆရာ Hugh Lofting ရဲ့ ဒေါက်တာ Dolittle စွန့်စားခန်းများကို အခြေပြုရိုက်ကူးထားတာပဲဖြစ်ပါတယ်…ဒီဇာတ်လမ်းထဲက ဒေါက်တာ Dolittle ဟာ တိရစ္ဆာန်တွေကို စကား​ပြောနိုင်တဲ့ ထူးခြားတဲ့စွမ်းရည်တစ်ခုရှိပြီး တိရစ္ဆာန်တွေကိုလည်းဆေးကုပေးနေတဲ့ ဆရာဝန်တစ်ယောက်ပေါ့…တစ်နေ့မှာ ကြေကွဲဝမ်းနည်းစရာအဖြစ်အပျက်တစ်ခုကြောင့် သူဟာ လူ့လောကကြီးနဲ့အဆက်အသွယ်ဖြတ်ပြီး အိမ်ထဲမှာ တံခါးပိတ်နေထိုင်နေရင်း မမျှော်လင့်ထားတဲ့ အဖြစ်အပျက်တွေ တံခါးခေါက်ရောက်ရှိလာပါတော့တယ်…ဇာတ်လမ်းအစကနေ အဆုံးအထိ ရယ်မောစရာလေးတွေနဲ့ဒီဇာတ်လမ်းကိုကြည့်ရှုရမှာဖြစ်ပြီး အဆုံးသတ်မှာ ကြည့်ရှုသူရင်ထဲ တစ်စုံတစ်ခုကျန်ခဲ့လိမ့်မယ်လို့ထင်ပါတယ်…ဇာတ်လမ်းထဲမှာ Doctor Dolittle အဖြစ်သရုပ်တောင်ထားသူက ပြည်သူချစ်မင်းသားကြီး Robert Downey, Jr. ဖြစ်ပြီး တခြား အသံသရုပ်ဆောင်တွေအနေနဲ့လည်း Tom Holland,Rami Malek , John Cena, Selena Gomaz စတဲ့ နာမည်ကြီးတွေ ပါဝင်ထားပါတယ် ကိုယ်တိုင်ကြည့်ရှုခံစားတော်မူပါကုန်။",
	downloadlink : "",
	watchlink : "",
	name : "Dolittle (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/1/1f/Dolittle_%282020_film_poster%29.png"
}



];

var animationarray = [

{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Nausicaa of the Valley of the Wind (1984)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/b/bc/Nausicaaposter.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Kiki's Delivery Service (1989)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/07/Kiki%27s_Delivery_Service_%28Movie%29.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Princess Mononoke (1997)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/8/8c/Princess_Mononoke_Japanese_poster.png"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Howl's Moving Castle (2004)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/a/a0/Howls-moving-castleposter.jpg/220px-Howls-moving-castleposter.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Spirited Away (2001)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Spirited_Away_Japanese_poster.png/220px-Spirited_Away_Japanese_poster.png"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "My Neighbor Totoro (1988)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/02/My_Neighbor_Totoro_-_Tonari_no_Totoro_%28Movie_Poster%29.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Tales from Earthsea (2006)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/e/e5/Gedo6sn.jpg/220px-Gedo6sn.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Ponyo (2008)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/Ponyo_%282008%29.png/220px-Ponyo_%282008%29.png"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "The Wind Rises (2013)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/a/a3/Kaze_Tachinu_poster.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "From Up on Poppy Hill (2011)",
	thumbnail : "https://vignette.wikia.nocookie.net/studio-ghibli/images/b/bb/From_Up_on_Poppy_Hill.jpg/revision/latest/scale-to-width-down/350?cb=20200318180952"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Whisper of the Heart (1995)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/Whisper_of_the_Heart_%28Movie_Poster%29.jpg/220px-Whisper_of_the_Heart_%28Movie_Poster%29.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "When Marnie Was There (2014)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/When_Marnie_Was_There.png/220px-When_Marnie_Was_There.png"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Porco Rosso (1992)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/f/fc/Porco_Rosso_%28Movie_Poster%29.jpg/220px-Porco_Rosso_%28Movie_Poster%29.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Ocean Waves (1993)",
	thumbnail : "https://vignette.wikia.nocookie.net/nicthic/images/9/9d/Ocean_Waves_2008_English_Poster.png/revision/latest/scale-to-width-down/310?cb=20180119002654"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "The Secret World of Arrietty (2010)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Karigurashi_no_Arrietty_poster.png/220px-Karigurashi_no_Arrietty_poster.png"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "The Cat Returns (2002)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/8/8e/Cat_Returns.jpg/220px-Cat_Returns.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Grave of the Fireflies (1988)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/a/a5/Grave_of_the_Fireflies_Japanese_poster.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Pom Poko (1994)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/Pompokoposter.jpg/220px-Pompokoposter.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "The Tale of Princess Kaguya (2013)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/The_Tale_of_the_Princess_Kaguya_%28poster%29.jpg/220px-The_Tale_of_the_Princess_Kaguya_%28poster%29.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Only Yesterday (1991)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/4/46/OYpost.jpg/220px-OYpost.jpg"
},
{
	review : "အယ်လ်ဆာနဲ့ အန်နာတို့ ညီအစ်မ ဟာအယ်ရန်ဒဲတိုင်းပြည်မှာ ပျော်ပျော်ရွှင်ရွှင်အတူနေထိုင်ကြပေမယ့် ကံဆိုးတဲ့တစ်နေ့ကိုရောက်လာပါတော့တယ်။အယ်လ်ဆာရဲ့ မိဘတွေတုန်းကရင်ဆိုင်ခဲ့ရတဲ့ မှော်ဝင်တောအုပ်ထဲကဝိညာဉ်တွေ၊ အယ်လ်ဆာပဲ ကြားနေရတဲ့ခေါ်သံတွေနဲ့အတူ သူတို့တိုင်းပြည်အန္တရာယ်ကျရောက်လာချိန်မှာ အန်နာတို့လည်းခရစ္စတော့ဖ်၊အိုလက်ဖ်၊ ဆဗန်တို့နဲ့အတူအတိတ်က အမှန်တရားကို ရှာဖွေရပါတော့တယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Frozen 2 (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/4/4f/Frozen_2_poster.jpg/220px-Frozen_2_poster.jpg"
},
{
	review : ``,
	downloadlink : "",
	watchlink : "",
	name : "Castle in the Sky (1986)",
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Castle_in_the_Sky_%281986%29.png/220px-Castle_in_the_Sky_%281986%29.png"
},
{
	review : "ကာတွန်းရုပ်ရှင်ကား ကောင်းကောင်းလေးတစ်ကားလောက် ကြည့်ရအောင်။ရုံတင်ကတည်းက လူကြိုက်များခဲ့တဲ့ ရုပ်ရှင်လေးပါပဲ။ဇာတ်လမ်းအကျဉ်း….ဟိုးရှေးရှေးတုန်းက ကမ္ဘာပေါ်မှာ မှော်ပညာ တည်ရှိခဲ့ပေမယ့်အချိန်ကြာလာတာနဲ့အမျှ လူတွေ၊နတ်သူငယ်တွေ၊ မှော်ဝင်သတ္တဝါတွေဟာခေတ်မီလာကြပြီး မှော်ပညာကို မေ့ပျောက်သွားပါတော့တယ်။အီယန် နဲ့ ဘာလေ ဆိုတဲ့ နတ်သူငယ် ညီအစ်ကိုနှစ်ယောက်ဟာလည်းငယ်ငယ်ကတည်းက အဖေဆုံးသွားလို့မိခင်နဲ့ပဲ အတူနေကြတဲ့ သူတွေပါ။ညီဖြစ်သူ အီယန်၁၆ နှစ်ပြည့်မွေးနေ့မှာတော့ သူတို့အဖေထားခဲ့တဲ့မှော်တောင်ဝှေးနဲ့ ဂါထာတစ်ခုကို တွေ့ရှိသွားပါတယ်။ဂါထာရဲ့ အစွမ်းကတော့ သေဆုံးသွားတဲ့ အဖေဖြစ်သူကို တစ်ရက်တိတိပြန်ရှင်သန်လာစေပြီး တွေ့ခွင့်ရမှာပါပဲ။ဒါပေမယ့် ဒီဂါထာကိုသုံးဖို့ စွမ်းအားကြီးတဲ့ ရတနာတစ်ခုလိုအပ်ပြီးအဲဒီရတနာ မလုံလောက်တာကြောင့် သူတို့အဖေဟာခန္ဓာကိုယ် အောက်ပိုင်းပဲ ကွက်ပြီး ရှင်လာခဲ့တယ်။ဒီလိုနဲ့ပဲ ညီအစ်ကို ၂ ယောက်ဟာ သူ့တို့အဖေရဲ့ခန္ဓာကိုယ်အောက်ပိုင်းကို သယ်ပြီး တစ်ရက်မပြည့်ခင်အဖေကို နောက်ဆုံးတွေ့နိုင်ဖို့မှော်ဝင်ရတနာကို အရှာထွက်ရပါတော့တယ်….ဒစ္စနေးရဲ့ ထုံးစံအတိုင်း ပျော်စရာတွေ ရယ်စရာတွေနဲ့ဝမ်းနည်းစရာတွေ ခံစားမှုတွေကို ရောယှက်ပေးထားမယ့်ကာတွန်းရုပ်ရှင်အသစ်မို့ ကြည့်တဲ့သူတွေသဘောကျကြမယ်ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Onward (2020)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/03/Onward_poster.jpg"
},

{
	review : "ပါးမိသားစုဝင်တွေဖြစ်တဲ့ ဘော့ဘ်၊ ဟယ်လန်၊ ဒက်ရှ်၊ ဗိုင်အိုလက်နဲ့ ဂျက်ဂျက်တို့ဟာ သူတို့ရဲ့ စူပါဟီးရိုးဝိသေသ The Incredibles အဖြစ်နဲ့ ဆက်ပြီးရှိ နေခဲ့ပါတယ်။ မက်ထရီဗစ်လီ ဘဏ်ဓားပြတိုက်မှုကို မကာကွယ်နိုင်တဲ့နောက်မှာတော့ အာဏာ ပိုင်တွေဟာ စူပါဟီးရိုးတွေအပေါ် ယုံကြည်မှုတွေ နည်းပါးလာတာ မို့ ကမ္ဘာအနှံ့မှာရှိနေတဲ့ စူပါဟီး ရိုးတွေဟာ မထင်မရှားနေခဲ့ရပါ တယ်။တစ်ရက်မှာတော့ ဘော့ဘ်၊ ဟယ်လန်နဲ့ သူတို့ရဲ့ မိတ်ဆွေ လူစီရက်စ်ဘက်စ် (စူပါဟီးရိုး Forzone) ဆီကို စူပါဟီးရိုးတွေ ကို သဘောကျတဲ့ ဆက်သွယ်ရေး လုပ်ငန်းရှင်၊ DEVTECH ပိုင်ရှင် ဝင်စတန်ဒီဗာက ဆက်သွယ်လာ ခဲ့ပါတယ်။ စူပါတွေ လူထုရဲ့ အားပေးမှုပြန်ရအောင်လို့ စတန့် အစီအစဉ်တွေပါဝင်ဖို့ ကမ်းလှမ်း တာလည်း ဖြစ်ပါတယ်။အဲဒါနဲ့ ဟယ်လန်ဟာ Elastigirl ဆိုတဲ့ စူပါဟီးရိုးနာမည် ဟောင်းနဲ့ပဲ ပါဝင်ဖို့ လက်ခံခဲ့ပါ တယ်။ ဝင်စတန်က ပါးမိသားစု အိမ်သစ်အထောက်ပံ့ပေးခဲ့ပြီး ဟယ်လန်စတန့်အစီအစဉ်အ တွက် သွားနေရင် အိမ်မှာကလေး တွေ ကြည့်ဖို့တာဝန်ကို ဘော့ဘ် က ယူခဲ့ရပါတယ်။ကလေးတွေနဲ့ နေရင်း ဘော့ဘ်ဟာ အငယ်ဆုံးလေးဂျက် ဂျက်ဆီမှာ စူပါပါဝါမျိုးစုံရှိနေ တယ်ဆိုတာ သတိထားမိခဲ့ပါ တယ်။ ဘော့ဘ်ဟာ ဂျက်ဂျက်ကို စူပါဟီးရိုးအဝတ်အစားဒီဇိုင်နာ အက်ဒ်နာဆီ ခေါ်သွားခဲ့ပြီး ဂျက် ဂျက်ရဲ့ အစွမ်းတွေကို ကြည့်ရှုစေ ခဲ့ပါတယ်။ဟယ်လန်ဟာ ဝင်စတန်ရဲ့ စူပါစတန့်အစီအစဉ်မှာ ပါဝင်နေ ရင်း မသင်္ကာစရာအခြေအနေ တစ်ခုကို သတိထားမိခဲ့ပါတယ်။ စူပါဟီးရိုးတွေကို အသုံးချပြီး ပြည်သူတွေကို အယူအဆလွဲမှား အောင် လုပ်နေတာမို့ လူထုကို သတိပေးဖို့ လုပ်နေတုန်း ဝင် စတန်ရဲ့ ညီမဖြစ်တဲ့ အီဗလင်းက ဟယ်လန်ကို ဒုက္ခပေးသလို ဘော့ဘ်နဲ့ လူစီရက်စ်တို့ကိုလည်း ထောင်ချောက်ဆင် ဖမ်းဆီးခဲ့ပါ တော့တယ်။အဲဒါနဲ့ အက်ရှ်၊ ဗိုင်အိုလက် နဲ့ ဂျက်ဂျက်တို့ မောင်နှမသုံး ယောက်ကို အက်ဒ်နာက စူပါဟီး ရိုးဝတ်စုံတွေ စီစဉ်ပေးခဲ့ပြီး သူတို့ အဖေနဲ့ အမေကို ကယ်တင်ဖို့ ဒက်ရှ်တို့တစ်တွေ ကြိုးပမ်းခဲ့ပါ တယ်။ စူပါဟီးရိုးပေါက်စသုံး ယောက်က သူ့မိဘတွေကို ဘယ် လိုနည်းလမ်းတွေနဲ့ ကယ်တင်မှာ လဲ၊ Incredibles မိသားစုအနေနဲ့ အီဗလင်းတို့ရဲ့ အဖျက်အမှောင့် အကြံအစည်ကို ဘယ်လိုတွေတုံ့ ပြန်မှာလဲ၊ စူပါဟီးရိုးတွေရဲ့ ဂုဏ် ပုဒ်ကို ပြန်အဖတ်ဆယ်နိုင်ပါ့ မလားဆိုတာတော့ ဆက်ကြည့် လိုက်ဦးနော်။ကလေး၊ လူကြီး ပရိသတ် အရွယ်စုံသဘောကျမယ့် ဒီဇာတ် ကားလေးမှာ အသံသရုပ်ဆောင် ပေးထားသူတွေက ခရစ်ဂ်တီ နယ်လ်ဆင်၊ ဟိုလီဟန်တာ၊ ဆာ ရာဗောင်းဝဲလ်၊ ဟက်ခ်မစ်လ်နာ၊ ဆမ်မြူရယ်အယ်လ်ဂျက်ဆင်၊ ဘရတ်ဘတ်၊ ဘော့ဘ်အိုဒန်ကစ်၊ ကက်သရင်းကီနာ စသူတွေပဲ ဖြစ် ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Incredibles 2 (2018)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/2/27/The_Incredibles_2.jpg"
},

{
	review : "မကြာခင်ကမှ ထွက်ရှိ ထားတဲ့ စိတ်ကူးယဉ်စွန့်စားခန်း Animation ဇာတ်ကားလေး ဖြစ်တဲ့Moanaကားလေး အကြောင်း ညွှန်း ပေးလိုက်ပါတယ်။Disney ရုပ်ရှင် ထုတ်လုပ်ရေးရဲ့ ၅၆ ခု မြောက် Animationဇာတ်ကား အဖြစ်နိုဝင်ဘာ ၂၃ ရက်ကမှ ထွက်ရှိထားတာပါ။#တီဖီတီ ဟာ ကျွန်းကို စောင့် ရှောက်တဲ့ နတ်သမီးတစ်ပါးဖြစ်ပြီးကျွန်းတွေ၊ အသက်ဝိညာဉ်တွေ စတဲ့ အရာအားလုံးကို ဖန်ဆင်း ထားသူဖြစ်ပါတယ်။#တီဖီတီ ရဲ့ နှလုံးသားဟာ ကျောက်စိမ်းတုံး လေးတစ်ခုအနေနဲ့ရှိပြီးအသက် ဝိညာဉ်တွေ ဖန်ဆင်းရာမှာ အသုံး ပြုနိုင်ပါတယ်။ အဲဒါကို လူသား နတ်ဘုရားဖြစ်တဲ့#မာဝီ က သူ့ရဲ့ စွမ်းအားတွေ၊ ဝိညာဉ်တွေ မြှင့် တင်ဖို့နဲ့ မှော်ငါးမျှားချိတ်ကြီး ဖန် တီးဖို့အသုံးပြုခဲ့ပြီး မီးတောင် ချော်ရည်မိစ္ဆာကောင်ကြီး #တီခါ နဲ့ ဆုံပြီးတဲ့နောက်တီဖီတီရဲ့ နှလုံးသားရော၊ မှော်ငါးမျှားချိတ်ကြီး ရော သမုဒ္ဒရာထဲမှာ ပျောက်ဆုံး သွားခဲ့ပါတယ်။ထောင်စုနှစ် တစ်ခုကြာအ ပြီးမှာတော့ #တီဖီတီ ဖန်ဆင်းထား တဲ့ မိုတန်နူဝီကျွန်းသူကြီး တွီရဲ့ အမေ တာလာဟာ သူ့မြေး #မိုအာနာ အပါအဝင်ကျွန်းပေါ်က ကလေးတွေကို ကျွန်းနဲ့ပတ်သက်တဲ့ ဒဏ္ဍာရီတွေကို ပုံပြင်ပြောပြလေ့ ရှိပါတယ်။တီဖီတီရဲ့ နှလုံးသားဖြစ်တဲ့ ကျောက်စိမ်းတုံးလေး ပျောက်ဆုံးနေတဲ့အတွက်ကျွန်းမှာ အန္တရာယ်တွေကျရောက်နိုင်တယ်လို့ တာလာက မကြာခဏ သတိပေးခဲ့ပါတယ်။တစ်ရက်မှာ မိုအာနာဟာ ကမ်း တင်နေတဲ့ လိပ်လေးတစ်ကောင် ကိုတွေ့ခဲ့ပြီး စင်ရော်တွေဝိုင်းနေ တာကြောင့် ရေထဲပြန်မဆင်းရဲ ဖြစ်နေတာကိုမိုအာနာကယ်ဆယ်ခဲ့ တာကို သမုဒ္ဒရာကြီးက အသိအ မှတ်ပြုတဲ့အနေနဲ့ တီဖီတီရဲ့ နှလုံး သားကို ပေးခဲ့ပါတယ်။မိုအာနာ့လက်ထဲက ကျောက် စိမ်းတုံးကို သူ့အဖေကသိမ်းသွား ခဲ့ပါတယ်။ ဒါပေမဲ့လည်း မိုအာနာရဲ့ အဘွားတာလာက ယူခဲ့ပြီးအဲဒီ အရာဟာ ကျွန်းသခင်မတီဖီတီရဲ့ ပျောက်ဆုံးနေတဲ့ နှလုံးသားဖြစ် တယ်လို့ မိုအာနာကိုပြောပြခဲ့ပါတယ်။ နောက်တော့ မိုအာနာတို့ကျွန်းမှာ အုန်းပင်တွေပျက်စီး၊ငါးတွေဖမ်း မမိနဲ့ တစ်ကျွန်းလုံး ဒုက္ခရောက် နေတာမို့ ကျွန်းကိုကျော်ပြီး အစာ ရှာထွက်ဖို့ မိုအာနာစိတ်ကူးခဲ့ပေမယ့် ဒေါသကြီး၊ စည်းကမ်းကြီးတဲ့ သူ့ အဖေက လက်မခံခဲ့ပါဘူး။နောက်တော့ မရတော့တဲ့အ ဆုံး မိုအာနာဟာ သူ့အချစ်တော် ဝက် ပေါက်လေး ပူးဝါးကိုခေါ်ပြီးသူ့အဘွားတာလာညွှန်ကြားတဲ့အတိုင်း လူသားနတ်ဘုရားမာဝီကိုရှာဖို့ သမုဒ္ဒရာထဲကို ထွက်သွားခဲ့ပါတော့တယ်။ လမ်းခရီးမှာ မုန် တိုင်းမိပြီးတခြားကျွန်းတစ်ကျွန်း ကို ရောက်သွားခဲ့ကာ အဲဒီမှာ မာဝီနဲ့ တွေ့ခဲ့ပါတယ်။အဲဒီအခါမှာ မိုအာနာက တီဖီတီရဲ့ နှလုံးကို နေရာ မှန်မှာထိန်းသိမ်းနိုင်မှ တစ်ကျွန်း လုံးအန္တရာယ်ကင်းမှာမို့မာဝီကူညီမှဖြစ်မယ့်အကြောင်း ပြောပြခဲ့ ပါတယ်။အဲဒီမှာလည်း တီဖီတီရဲ့ နှလုံးသားကိုလုမယ့် ပင်လယ်ဓားပြ အဖွဲ့နဲ့လည်းရင်ဆိုင်ခဲ့ကြရပြန်ပါ တယ်။ စွမ်းအားကြီးတဲ့ မာဝီဟာ ငှက်အသွင်လည်းပြောင်းလို့ရပြီးသူ့ရဲ့မှော်ငါးမျှားချိတ်ကြီး ပျောက်ဆုံးနေတဲ့အတွက်မိုအာနာကူရှာပေး ခဲ့ပြီး အတူတိုက်ပွဲဝင်ခဲ့ကြတော့ တယ်။မိုအာနာတစ်ယောက် မာဝီနဲ့ အတူ သူတို့ကျွန်းမှာ ရောက်နေ တဲ့မကောင်းဆိုးဝါးတွေကို ဘယ် လိုနှိမ်နင်းမှာလဲ။ နတ်ဘုရားမ တီဖီတီရဲ့နှလုံးသားကိုကော မူလနေရာရောက်အောင် ပြန်ထားခွင့်ရမှာလားဆိုတာတော့ကိုယ်တိုင်ပဲ ဆက်ကြည့်လိုက်ဦးနော်………အထူးပြုလုပ်ချက်တွေကောင်းလွန်တဲ့ Animation ဇာတ်ကားမို့ ကလေး၊လူကြီး မရွေး သဘောကျမှာ သေချာသလောက်ပါပဲ။အသံသရုပ်ဆောင်ထားသူတွေက မိုအာနာအဖြစ် အော်လီအိုင်ခရက်ဗယ်ဟို၊မာဝီအဖြစ် ဒွိန်းဂျွန်ဆင်၊ တာလာအဖြစ် ရေချယ်ဟောက်စ် စသူတွေပဲ ဖြစ်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Moana (2016)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/2/26/Moana_Teaser_Poster.jpg"
},

{
	review : "Zootopia (2016) ကို ရုံတင်တုန်းက သွားကြည့်ရတဲ့ ဖီလင်ကယခင် ကားသစ်တွေ ရုံမှာသွားကြည့်ရတဲ့ ခံစားချက်တွေနဲ့ ဘာမှမဆိုင်ဘူးပိုက်ဆံပေးကြည့်ရတာထက် ပိုတန်တယ်…ပြီးတော့ ယုန်မလေး ရဲ့ မျက်နှာဟာ ယုန်တစ်ကောင်နဲ့ မတူပဲချစ်စဖွယ်ကောင်မလေး မျက်နှာလိုပဲ ဘယ်လိုကြည့်ကြည့် ချစ်ဖို့ကောင်းတယ်ဒါ့အပြင် မြေခွေး ဆိုလဲ သူ့ရဲ့ ပုံစံနဲ့ လိုက်ဖက်စွာ အကျင့်ယုတ်တာတွေလိမ်တာတွေ နောက်ပြောင်တာတွေက မျက်နှာထား အပြင် ဝတ်စားပုံနဲ့ပါလိုက်ဖက်နေတယ် ဥပမာ ကျနော်တို့ ပျိုတိုင်းကြိုက်တဲ့ လူစီဖာမောနင်းစတားရဲ့ မျက်ခွက်နက် ချွတ်စွတ်သွားတူနေတာမျိုးပိုသဘောကျမိတာက ဒီကာတွန်းကားတွက် ဇတ်ကောင်တွေ အများကြီးသုံးထားတာကိုပေါ့…မြေခွေး နဲ့ ယုန်မလေး ဆီမှာပဲ အာရုံစိုက်နေလို့ မရပြန်ဘူးကျန်တဲ့ သတ္တဝါလေးတွေကတစ်ယောက်တစ်မျိုး ချစ်ဖို့ကောင်း စိတ်ဝင်စားဖို့ကောင်းနေပြန်ပါတယ်…ပိုလန်းတာက လူတွေ ရူးသွပ်နေတဲ့ iPhone ပုံစံ ဆင်တူတဲ့မုံလာဥ တံဆိပ် ဖုန်းကို ဒီဇာတ်ကားထဲမှာ မြင်မိတာနဲ့ သင်ပြုံးမယ်ဆိုတာအာမခံပါတယ်ဇတ်ဝင်သီချင်းတွေကလဲ အလန်းတွေကြီးပါပဲ မြူးမြူးကြွကြွ နဲ့ဇတ်ကားပုံစံ ကို ပိုပြီး အသက်ဝင်စေပါတယ်…",
	downloadlink : "",
	watchlink : "",
	name : "Zootopia (2016)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/9/96/Zootopia_%28movie_poster%29.jpg"
},

{
	review : "How To Train Your Dragon ဟာ ၁ နဲ့ယခုဇတ်သိမ်းမယ့် ၃ ဟာ ၉ နှစ်ခြားခဲ့ပါတယ်…How To Train Your Dragon ရဲ့ပရိတ်သတ်တွေအမြောက်အမြားဆိုတာယုံမှားဖွယ်မရှိပါဘူး…ဇာတ်လမ်းအကျဉ်းဟစ်ကပ်တို့ရဲ့ ဘာ့ခ်မှာ နဂါးတွေ တဖြည်းဖြည်းများပြားလာသလိုနဂါးမုဆိုးတွေရဲ့ ရန်ကလည်း ပိုကြီးမားလာပါတယ်။ဒါကြောင့် နဂါးတွေနဲ့ သူ့လူတွေ လုံခြုံစေဖို့ ဟစ်ကပ်ဟာကမ္ဘာကြီးရဲ့ အဆုံးက လျို့ဝှက်နေရာတစ်ခုကိုရှာဖွေဖို့ ကြိုးစားပါတော့တယ်။",
	downloadlink : "",
	watchlink : "",
	name : "How to train your dragon 3 (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/f/fd/How_to_Train_Your_Dragon_3_poster.png"
},

{
	review : "ရုပ်ရှင်ချစ်သူတွေထဲမှာ တွိုင်းစတိုရီကို မကြည့်ဖူးဘဲကြီးပြင်းလာတဲ့သူဆိုတာ အတော်ရှားပါလိမ့်မယ်။ငယ်ငယ်တုန်းကတည်းက တွိုင်းစတိုရီကိုကြည့်ပြီးကိုယ့်အရုပ်လေးတွေ ဘယ်လိုများ အသက်ဝင်မလားမလဲတောင်ချောင်းကြည့်ဖူးကြတဲ့သူတွေ ရှိမလားမသိဘူး။ဝုဒီတို့ ဘက်ဇ်တို့နဲ့ မိတ်ဆွေတစ်သိုက်ဟာမိတ်ဆွေတွေတိုးရင်း စွန့်စားခန်းတွေ ဖွင့်ရင်း နေလာခဲ့တာနှစ်ပေါင်းတွေ ကြာလာခဲ့ပါပြီ။အရုပ်တွေအတွက ်သူတို့ရဲ့ ပိုင်ရှင်ကလေးငယ်ဆိုတာ ဘဝကြီးပါပဲ။ဒါပေမယ့် အဲဒီပိုင်ရှင်တွေရဲ့ သက်တမ်းက တိုတောင်းပါတယ်။သေဆုံးသွားတာ မဟုတ်ပေမယ့်လည်း ကြီးပြင်းလာတဲ့အချိန်မှာအရုပ်တွေကို စွန့်ပစ်ကြတာ၊ ဒါမှမဟုတ်အခြားကလေးကို ပေးပစ်ကြတာတွေ လုပ်ကြတာပေါ့။ဒီလိုနဲ့ ဘိုပိ ဟာလည်းအခြားပိုင်ရှင်တစ်ယောက်ဆီကိုရောက်သွားပြီး ဝုဒီတို့နဲ့ ကွဲကွာသွားခဲ့ပါပြီ။ဒီတစ်ခေါက်မှာလည်း အန်ဒီဟာဘွန်နီဆိုတဲ့ ကလေးမလေးဆီကို သူ့ရဲ့အရုပ်တွေပေးပစ်လိုက်တာကနေ စတင်ပါတယ်။ဘွန်နီဟာ အရုပ်လေးတွေကိုချစ်ပြီး နေ့တိုင်းကစားတတ်ပေမယ့်သူ ရွေးနေကျမဟုတ်ဘဲ ချန်ထားခဲ့တဲ့အရုပ်လေးတွေ ရှိတတ်ပါတယ်။အဲဒီအထဲမှာ တစ်ချိန်က အန်ဒီရဲ့ အချစ်တော်ဝုဒီလည်း ပါနေတာပေါ့။ဒီလိုနဲ့ ဘွန်နီလေး ပထမဆုံး မူကြိုကို ကြောက်ကြောက်လန့်လန့်နဲ့သွားရင်းနဲ့ ဇွန်းခရင်း တစ်ခါသုံးလေးကိုဖော့ကီဆိုတဲ့ အရုပ်အဖြစ် ဖန်တီးလိုက်မိပါတယ်။ပြီးတော့ အဲဒီ ခရင်းရုပ်လေးက ဘွန်နီရဲ့ မူကြိုကျောင်းမှာအားပေးမယ် အဖော်လေးဖြစ်လာပါတော့တယ်။ဒါပေမယ့် ဖော့ကီဟာ မထင်မှတ်ဘဲ ဘွန်နီနဲ့ကွဲကွာသွားတဲ့အခါမှာတော့ ဝုဒီဟာဖော့ကီကို လိုက်ကယ်ဖို့ သူ့မိတ်ဆွေတွေနဲ့အတူ စွန့်စားခန်းတွေ ဖွင့်ရပါတော့မယ်….တွိုင်းစတိုရီ-၄ ဟာလည်း အရင်ကားတွေလိုပဲမိတ်ဆွေစိတ်တွေ၊ အရုပ်တွေနဲ့ကလေးတွေရဲ့ သံယောဇဉ်တွေကိုလှလှပပ ပုံဖော်ထားတာပဲမို့ကြည့်တဲ့သူတွေ ကြိုက်ကြမှာပါ။",
	downloadlink : "",
	watchlink : "",
	name : "Toy story 4 (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/4/4c/Toy_Story_4_poster.jpg"
},

{
	review : "နိုင်ငံတကာမှာလည်းအောင်မြင်မှုများစွာရခဲ့သလို..ရုပ်ရှင်ဝေဖန်ရေးတွေကလည်း ချီးကျူးထားတဲ့ Animation ဇာတ်လမ်းကောင်းလေးဖြစ်ပါတယ် ..Animation တကားအနေနဲ့လည်း ထူးထူးခြားခြား IMDb Rating မှာ 8.5 အထိ တောင်ရောက်ရှိထားတာမို့ ကောင်းလားမကောင်းလားဆို တာလုံးဝစဉ်းစားနေစရာလိုမှာလည်းမဟုတ်တဲ့အပြင်..ကြည့်သင့်တဲ့ Animation ဖြစ်ကြောင်းအသိ ပေးချင်ပါတယ်။အညွှန်းလေးအရင်ခံစားကြည့်ရအောင်အညွှန်းကနည်းနည်းတော့ရှည်ပါတယ်..သေသေချာချာခံစားချင်ရင် တော့စာကိုအဆုံးထိဖတ်ဖို့အကြံပေးလိုက်ပါတယ်..ဒီကားက Pixar ရဲ့ ကာတွန်းကားကောင်းတစ်ကားဖြစ်ပြီး၊ ကလေးလူကြီးမရွေး ကြည့်နိုင်တဲ့ဇာတ်ကား ကောင်းတစ်ကားပါ။ The Incredibles ဇာတ်ကား Review တုန်းက Pixar ရဲ့ အကြောင်း ပရိတ်သတ်ကြီးကို ပြောပြခဲ့ဖူးပါတယ်။ ဒီကုမ္ပဏီကရိုက်တဲ့ ကာတွန်းတိုင်းက ဇာတ်လမ်းကောင်းပြီး အနုပညာရသမြောက် တယ်လို့ အားလုံးသိထားကြပါတယ်။ ဒီကားကလည်း ဒီအတိုင်းပဲ အနုပညာရသမြောက်အောင် ရိုက်ကူးထားနိုင်သလို၊ တကယ့် ဝမ်းနည်းကြည်နူး စရာ ကောင်းပြီး၊ ခံစားချက်ရသစုံပေးနိုင်အောင် ရိုက်ကူးထား နိုင်တာတွေ့ရပါတယ်။Pixar အကြောင်းပြောရင် Toy Story 1, 2, 3 ကို မပြောပဲ နဲ့မပြီးပါဘူး။ ဒီသုံးကားက Pixar အတွက်သာမက ကာတွန်းကားတွေအားလုံးထဲမှာပါ အကောင်းဆုံး လို့ သတ်မှတ်ထားကြတာဖြစ်ပြီး Original Idea ဖြစ်တဲ့ Toy Story 1 က အကောင်းဆုံး လို့သတ်မှတ်ထားကြပါတယ်။ ကျွန်တော်ဘာလို့ဒီအကြောင်းကို ပြောရလည်းဆိုရင် ဒီ Inside Out က Toy Story ဇာတ်လမ်းတွေနဲ့တန်းတူ ကောင်းတဲ့ ကာတွန်းကားဖြစ်ပြီး အနုပညာရှုထောင့်ကကြည့်ကြည့်၊ ဖျော်ဖြည်ရေး ရှုထောင့်ကကြည့်ကြည့် ကောင်းမွန်တယ်လို့ပြောလို့ရပါတယ်။ဒီကားက ကာတွန်းကားဖြစ်လို့ လူတော်တော်များများက ကလေးတွေအတွက်ပဲလို့ ထင်ကြမှာပါ။ တကယ်တော့ ဒီကားက ကလေးရော လူကြီး ပါကြည့်ဖို့သင့်တော်ပြီး၊ လူကြီးတွေ အရွယ်ရောက်ပြီးသား လူတွေက ဒီကားကိုပိုပြီး နားလည်မှာဖြစ်ပါတယ်။ ဘာလို့လည်းဆိုတော့ ဇာတ်လမ်းက လူရဲ့ စိတ်ထဲမှာရှိတဲ့ ခံစားချက်လေးတွေ အကြောင်းရိုက်ထားတာဖြစ်ပြီး၊ အသက်ကြီးလာတာနဲ့အမျှ ခံစားချက်တွေပြောင်းလာပုံ၊ ဒီစိတ်ခံစားချက်တွေက ကဘယ်လိုအရေးပါပုံကို စိတ်ဝင်စားစရာ ဇာတ်လမ်းလေးနဲ့တင်ဆက်ထား တာဖြစ်ပါတယ်။ဒါကြောင့် ဇာတ်လမ်းမပြောခင်မှာ ကြိုပြီးပြောချင်ပါတယ်၊ ဒီကားလေးကိုကြည့်ဖြစ်အောင်ကြည့်ကြပါ။ ကလေးရော လူကြီးပါ ကြည့်သင့်ပြီး၊ ကလေးတွေလည်း ကြိုက်မှာဖြစ်သလို လူကြီးတွေလည်း နားလည်ခံစား နိုင်မှာဖြစ်ပါတယ်။ ဒီကားကြည့်နေရင်းနဲ့ ပရိတ်သတ်တော်တော်များများ မျက်ရည်ဝဲရသလို ဇာတ်လမ်းအဆုံးမှာ စိတ်ကျေနပ်မှုကို ရစေမှာဖြစ်ပါတယ်။ မိသားစုတူတူကြည့်နိုင်ပါတယ်။အသဲမာတဲ့သူတောင်မှ ဒီကားကြည့်ပြီးရင် အနည်းနဲ့အများတော့ ခံစားရမှာဖြစ်ပါတယ်။ ဇာတ်လမ်းအကြောင်းပြောရရင်တော့ ဇာတ်လမ်းဇာတ်အိမ်က Riley ဆိုတဲ့ကောင်မလေးနဲ့ သူ့ရဲ့ စိတ်ခံစားချက်လေးတွေအကြောင်း တင်ဆက်ထားပြီး Riley က အမေရိကန်နိုင်ငံ အလယ်ပိုင်း ပြည်နယ်တစ်ခုဖြစ်တဲ့ Minnesotaမှာ နေထိုင်ပါတယ်။ လူတွေရဲ့စိတ်မှာ Joy (Happiness, Color-Gold), Sadness (Color-Blue), Fear (purple), Disgust (Green), Anger(Red) ဆိုပြီး basic feeling ၅မျိုးရှိတယ်လို့ ကာတွန်းကဆိုထားပါတယ်။ ဇာတ်လမ်းအစမှာ မွေးကာစ Riley လေးမှာ Joy ဆိုတဲ့ပျော်ရွှင်မှုလေး စတင်ဖြစ်ပေါ်လာသလို၊ Sadness ကလည်း ကပ်ပါလာပါတယ်။ ဒါကြောင့် မွေးကာစမှာ တစ်ချိန်လုံး ငိုနေကြတာဖြစ်ပါတယ်။ ဒီနောက်မှာတော့ ကလေးဘဝ ပြေးလွှားဆော့ကစားရင်း မသိတဲ့အရာကို ကြောက်စိတ်လေးတွေရှိသလို၊ မစားချင်တာကို အဖေအမေက ကျွေးရင် ရွံရှာတဲ့စိတ်ဖြစ်လာပြီး၊ ဒေါသလည်းထွက်လာတတ်တယ်ဆိုတာကို သဘာဝကျကျ ပီပီပြင်ပြင် သရုပ်ဖော်ထားပါတယ်။ဒီနောက်မှာတော့ ဇာတ်လမ်းကနေ လူတွေရဲ့ Personality လို့ခေါ်တဲ့ ကိုယ်နေဟန် စိတ်နေသဘောထား စတာတွေက ကလေးဘဝ မှတ်ဉာဏ်လေးကနေ ဖြစ်တည်လာတည်လို့ဆိုပြီး ဥပမာလေးတွေပေးထားပါတယ်။ ကလေးဘဝမှာ အဖေအမေနဲ့ စနောက်ပြောင်ရင်းနဲ့ သူမမှာ အပြောင်အပျက်လုပ်တဲ့စိတ်ကလေးရှိလာပြီး ဒါလေးက အမြစ်တွယ်သွားပြီး သူမရဲ့ စိတ်နေစိတ်ထားထဲမှာ ပါလာသလို၊ သူ့အဖေက ကလေးဘဝမှာ ရေခဲပြင် ဟော်ကီကို ကစားစေခဲ့တာကြောင့် သူမကျောင်းတက်တဲ့အခါမှာ ဒီကစားနည်းကို နှစ်သက်လာသလို ဒီကစားနည်းမှာလည်း ထူးချွန်ခဲ့ပါတယ်။ ဒါ့အပြင် လူတွေမှာ အရေးအကြီးဆုံးဖြစ်တဲ့ မိသားစုနဲ့ သူငယ်ချင်းဖွဲတဲ့ Memory ကလည်း သူမထံမှာရှိနေသလို အမှန်အတိုင်းဝန်ခံတတ်တဲ့ အကျင့်ကလည်း သူမရဲ့ Core memory ထဲမှာရှိနေပါတယ်။ဒီနေရာမှာ Core Memory တွေဆိုတာက သူမရဲ့ ကလေးဘဝက အမှတ်တရ အဖြစ်အပျက်လေးတွေနဲ့ ဖွဲ့စည်းထားပြီး၊ မိသားစု နဲ့ပတ်သက်တဲ့ Memory တွေ၊ အဖေနဲ့ ရေခဲပြင်ဟော်ကီ ကစားတုန်းက ပထမဆုံး ဂိုးသွင်းလိုက်တဲ့ အခိုက်အတန့်လေးတွေ၊ ကလေးဘဝမှာ အဖေနဲ့ နောက်ပြောင်ပြီး အရှက်အကြောက်မရှိ သေးတဲ့အရွယ်မှာ တုံးလုံးပတ်ပြေးခဲ့တွေ၊ မိသားစု ခရီးသွားတာတွေပါပါတယ်။ဒီလိုနဲ့ ဇာတ်လမ်းအစမှ ဇာတ်လမ်းသဘောတရားကို ရှင်းပြပြီးနောက်၊ သူတို့မိသားစုက Minnesota ကနေ အနောက်ဘက် ပြည်နယ် California က San Francisco ကိုပြောင်းပြီးနေရပါတယ်။ ဒီအချိန်မှာ ၁၁ နှစ်လုံး နေလာခဲ့တဲ့ အိမ်ရယ်၊ သူငယ်ချင်းတွေရယ်၊ ဟော်ကီအသင်းရယ်ကို စွန့်ခွာပြီး နေရာသစ်ကိုပြောင်းလာရတဲ့ Riley တစ်ယောက် မြို့သစ်မှာ အခြေကျအောင် နေရာပုံကို ဇာတ်လမ်းလုပ်ထားပါတယ်။ ဒါက ဇာတ်လမ်း အကြမ်းဖြင်းပါ။သူမရဲ့ ခေါင်းထဲမှာ Joy က အဓိက ကျပြီး သူမပျော်ရွှင်အောင် ထားပေးနေရတာဖြစ်သလို၊ San Francisco ကိုရောက်လာတဲပအချိန်မှာ ဝမ်းနည်းနေတဲ့စိတ်ကို ဖုံးပြီး မပျော်ပျော်အောင်လုပ်နေပါတယ်။ ဒါကြောင့် Sadness ကို နေရာမပေးပဲ Core Memory တွေနားကနေ ဝေးဝေးနေခိုင်းပါတယ်။ ဘာလို့လည်းဆိုတော့ Sadness က ထိလိုက်တာနဲ့ Core Memory တွေက အရောင်ပြောင်းသွားပြီး Riley ကလည်း ဝမ်းနည်းသွားတတ်လို့ပါ။ ဒါကြောင့် Joy ကသူမကိုပျော်အောင်ထားဖို့ Sadness ကိုချောင်ထိုးထားပါတယ်။ဒီလိုနဲ့ အတန်းသစ်သွားတက် ပြီးဆရာမက အတန်းထဲမှာ မိတ်ဆက်ခိုင်းတဲ့အခိုက်မှာ Minnesota က အကြောင်းကို ပြန်ပြောပြနေတုန်း Sadness ကလည်း သူမကိုသူမ ထိမ်းချုပ်လို့မရပဲ Core Memory ကို ထိမိသွားပြီး ဝမ်းနည်းသွားရာက စာသင်ခန်းထဲမှာ ငိုမိပါတော့တယ်။ ဒါကြောင့် Joy နဲ့ Sadness က လုနေကြရင်းနဲ့ အမှတ်မထင်ပဲ Memory တွေသိမ်းတဲ့ ပိုက်လိုင်းကနေ ဦးနောက်ရဲ့ Long-term Memory Storage မှတ်ဉာဏ်တွေထားတဲ့အခန်း ကိုရောက်သွားပါတယ်။ ဒီနေရာမှာ Fear, Disgust နဲ့ Anger တို့ပဲ ကျန်ခဲပပြီး အပြင်မှာလည်း အတန်းထဲမှာငိုမိတဲ့ Riley တစ်ယောက် ရှက်ကြောက် မိသလို ကိုယ့်ကိုကိုလည်း ဒေါသထွက် လာပါတယ်။ Joy မရှိတဲ့တဲ့ ခေါင်းထဲမှာ ကျန်တဲ့သုံးယောက်ဘာလုပ်ရမှန်းမသိဖြစ်နေပြီး၊ ဟော်ကီအသင်း သစ်အတွက် လူရွေးခံရာမှာလည်း အဆင်မပြေဖြစ်ခဲ့ပါတယ်။ဒီအချိန်မှာ Joy နဲ့ Sadness တို့ နှစ်ယောက် ဌာနချုပ်ကို ပြန်ရောက်အောင် သွားနေရာက Core Memory တွေမရှိတော့လို့ Hockey ကစားတာ အဆင်မပြေဖြစ်သွားတာကြောင့် Riley ရဲ့ Hockey နဲ့ပတ်သက်တဲ့ memory က ပျက်ဆီးသွားပါတယ်။ Core Memory တွေနဲ့အတူ ဌာကိုပြန်ရောက်ရေးအတွက် Joy တစ်ယောက် အသည်းအသန်ကြိုးစားပုံကို စိတ်ကူးကောင်းကောင်းနဲ့တင်ဆက်ထားပါတယ်။ ဒီလိုအပြန်ခရီးမှာ သူမရဲ့ Subconscious လို့ခေါ်တဲ့ မသိစိတ် ထဲမှာဘာတွေရှိတယ်၊ သူမရဲ့ ကလေးဘဝတုန်းက imaginary friend (စိတ်ကူးထဲက သူငယ်ချင်း၊ ဥပမာ ကလေးဘဝတုန်းက ဆော့စရာအဖော်မရှိရင် ကိုယ်စိတ်ကူးလေးနဲ့ကိုယ်ကစားတတ်သလို တစ်ချို့ကလည်း အနားမှာကစားဖော်ရှိသလိုမျိုး စိတ်ကူးယဉ်တတ်ပါတယ်။) ဖြစ်တဲ့ Bing Bong ကို Joy က လမ်းမှာသွားတွေ့သလို သူ့ရဲ့အကူအညီနဲ့ ဌာနချုပ်ကို အရောက်သွားဖို့ ကြိုးစားကြပါတယ်။ဒီနေရာမှာ အများကြီး ရှင်းပြဖို့မလိုပေမယ့် ပြောချင်တာ နှစ်ခုရှိပါတယ်။ တစ်ခုက ဟောင်းသွားတဲ့ မှတ်ဉာဏ်တွေ စွန့်ပစ်တဲ့ချောက်ကြီးရှိပြီး အဲဒီအထဲကျသွားရင် ဘယ်တက်လို့မရတော့ပါဘူး။ နောက်တစ်ချက်က Sadness ကို အစပိုင်းမှာ မကောင်းဘူးလို့ ပြထားပေမယ့် Sadness ဆိုတာ ဘာလို့ရှိရတယ်၊ လူတွေဘာလို့ ဝမ်းနည်းတယ်ဆိုတာ ပညာသားပါပါနဲ့ သရုပ်ဖော်ထားပါတယ်။ ဒီအကြောင်းကို အဆုံးမှာ ထည့်ပေးထားမှာဖြစ်ပြီး Spoiler မဖတ်ချင်တဲ့သူတွေက ဒီနေရာမှာတင်ရပ်လိုက်ပြီး ဇာတ်ကားကိုသွားကြည့်သင့်ပါတယ်။ကလေးတွေအတွက်သီးသန့်ရိုက်ထားတာ မဟုတ်ပါဘူး။ လူတိုင်းကြည့်သင့်တဲ့ကားပါ။ ဒီကားက တစ်သက်မှာ တစ်ခါ၊ Generation (မျိုးဆက်) တစ်ခုမှာ တစ်ခါ ကြုံတောင့်ကြံုခဲ ထွက်လာတဲ့ ဇာတ်ကားမျိုးဖြစ်ပြီး၊ ဒါမျိုးဇာတ်ကား အရင်က မရှိခဲ့သလို နောက်ထပ် ထပ်ရှိဖို့လည်းမလွယ်တော့ပါဘူး။ (Sequel ကိုမဆိုလိုပါဘူး။) ဥပမာ ရုပ်ရှင်လောကမှာ Godfather နဲ့ Citizen Kane က Masterpiece ဆိုရင် Toy Story နဲ့ Inside Out က ကာတွန်းတွေထဲမှာ တစ်သက်မှ တစ်ခါကြည့်ရခဲ့တဲ့ ကာတွန်းမျိုးတွေပါ။ဒီကားက ပြီးခဲ့တဲ့ ၅ နှစ်အတွင်းမှာ ကျွန်တော်ကြည့်ဖူးသမျှကားတွေထဲက အကောင်းဆုံး ရသပေးနိုင်တဲ့ ကားဖြစ်ရုံသာမက အကောင်းဆုံး ပညာပေးနိုင်တဲ့ ဇာတ်ကားလည်းဖြစ်ပါတယ်။ လက်မလွှတ်တမ်း ကြည့်သင့်တဲ့ဇာတ်ကားဖြစ်ပါတယ်။ လူတိုင်းကြည့်သင့်ပါတယ်။အထက်ကပြောခဲ့တဲ့ Sadness က ဘာလို့ရှိရတယ် လူတွေဘာကြောင့်ဝမ်းနည်းတယ်ဆိုတာကို ကျွန်တော် ဒီမှာနည်းနည်းရှင်းပြပါမယ်။ ဒါက ဒီကားတစ်ကားလုံးနဲ့ အဓိက ကျတဲ့ဇာတ်ဝင်ခန်းဖြစ်ပါတယ်။ Joy နဲ့ Sadness တို့ ဌာနချုပ်ကိုပြန်နေရင်းနဲ့ လမ်းမှာ Joy က memory လေးတစ်ခုကို ရှာတွေ့သွားပါတယ်။ ဒီမှာ သူမရဲ့ အသင်းက သူမကို ဝိုင်းအားပေးနေကြတာဖြစ်ပြီး အဖေနဲ့အမေက လည်း အနားမှာ အားပေးနေကြပါတယ်။ ဒါကြောင့် သူမက Sadness ကို နင်ဒီနေ့လေးကိုမှတ်မိလား Riley ပျော်နေတဲ့နေ့လေ လို့ ပြောတော့ Sadness က သူမမှတ်မိတာ အဲ့ဒီနေ့က ကောင်မလေးက အသင်းအတွက် အရေးပါတဲ့ဂိုးကိုမသွင်းပေး နိုင်လို့ အသင်းရှုံးသွားတာကြောင့် ဝမ်းနည်းနေတာကိုမှတ်မိတယ်လို့ပြန်ပြောပါတယ်။ဒီအခါမှာ Joy က Sadness ကို ဆက်မပြောဖို့တားပြီး ပျော်အောင်နေဖို့ပြောပါတယ်။ ဒီကနေ နောက်ဆုံးအခန်းမှာ Joy နဲ့ Riley ရဲ့ စိတ်ကူးယဉ်သူငယ်ချင်း Bing Bong တို့ Memory စွန့်ပစ်တဲ့ ခြောက်ထဲကို ကျသွားခဲပါတယ်။ ဒါကြောင့် Joy က အထက်ကို ပြန်တက်ဖို့ကြိုးစားရင်းနဲ့ မရတဲ့အဆုံးမှာ ဝမ်းနည်းပြီး သူမနဲ့အတူ သယ်လာတဲ့ Memory လေးတွေကိုပြန်ကြည့်မိပါတယ်။ ဒီနေရာမှာ ခုနက အသင်းသားတွေနဲ့အဖေအမေ တို့အားပေးနေတဲ့ Memory လေးမှာ အမှတ်မထင် နောက်ကို ပြန်ရစ်ကြည့်လိုက်မိတဲ့အခါမှာ Sadness ပြောသလိုပဲ သူမကြောင့် အသင်းရှုံးလို့ အားငယ်နေတဲ့ Riley ကိုတွေ့ရလိုက်ရပါတယ်။ ဒီအချိန်မှာပဲ အဖေနဲ့အမေက ရောက်လာပြီး အားပေးကြသလို၊ သူငယ်ချင်းတွေက လည်းလာအားပေးကြပါတယ်။ဒီမှာ Joy သဘောပေါက်သွားတာက ဝမ်းနည်းတဲ့အချိန်မှာ မိသားစုရော သူငယ်ချင်းတွေပါ အနားကိုလာပြီး အားပေးကြလို့ ပျော်ရွှင်သွားရတယ်ဆိုတာဖြစ်ပါတယ်။ ဒါကြောင့် Sadness မရှိရင် Joy လည်းမရှိနိုင်သလို၊ ကိုယ်ဝမ်းနည်းနေတာကို ထုတ်မပြရင် ကိုယ့်ကိုချစ်တဲ့သူတွေကလည်း ကိုယ့်ကိုအားပေးဖြစ်မှာ မဟုတ်တော့ပါဘူး။ ဒါကြောင့် Riley ရဲ့ Core Memory တွေကို Sadness က ထိလိုက်တဲ့အခါ အရောင်ပြောင်သွားတာဖြစ်ပါတယ်။ ဘာလို့လည်းဆိုတော့ သူမရဲ့ Core Memory အဟောင်းတွေက Minnesota က မှတ်ဉာဏ်တွေဖြစ်ပြီး ဒါတွေက အတိတ်မှာ ကျန်ခဲ့လေတော့ ဝမ်းနည်းစရာတွေဖြစ်သွားတာဖြစ်ပါတယ်။ဒီလို နဲ့ Joy က အပေါ်ပြန်ရောက်အောင်လုပ်ပြီး Sadness နဲ့ အတူ ဌာနချုပ်ကို ပြန်သွားရပါတော့တယ်။ ဒီလို ချောက်ထဲက ပြန်တက်တဲ့အခန်းလေးက အရမ်း ပညာသားပါပြီး၊ ကြေကွဲဖို့ကောင်းသလို သေချာတွေးကြည့်ရင် အရမ်းကောင်းတဲ့ အခန်းလေးဖြစ်ပါတယ်။ ဘာလည်းဆိုတာတော့ ကျွန်တော်ပြောတာထက် ကိုယ်တိုင်ကြည့်ရင်ပိုကောင်းပါတယ်။ ဒီအခန်းမှာ စိတ်မနိုင်သူတွေ ဆို မျက်ရည်ကျရတဲ့အထိကိုကောင်းပြီး ကျွနေ်တာ်ကိုယ်တိုင်တောင် မျက်ရည်ဝဲမိတဲ့ အခန်းဖြစ်ပါတယ်။ လူတွေအားလုံးလည်း အသံတိတ်နေပြီး တကယ်ကိုကောင်းပါတယ်။ အထူးသဖြင့် ဘယ်သူမှ မထင်မှတ်ထားပဲ ရုတ်တရက်ဖြစ်သွားတာလေးပါ။ တစ်ကားလုံးမှာ အကောင်းဆုံး ဇာတ်ဝင်ခန်းဖြစ်ပါတယ်။ ဒါ့အပြင် ဒီကားတစ်ကားလုံးမှာ ပရိတ်သတ်အမှတ် ရနေစေမယ့် စကားတစ်ခွန်းလည်း ရှိပါတယ်။ဌာနချုပ်ရောက်တဲ့အခါမှာတော့ Anger ရဲ့ မဆင်မခြင်လုပ်မှုကြောင့် Riley က အိမ်ကနေထွက်ပြေးပြီး Minnesota ပြန်ပြေးဖို့ လုပ်နေပါတယ်။ ဒါကို မှားမှန်းသိပေမယ့် ပြင်ဆင်လို့မရတော့ပါဘူး။Riley တစ်ယောက် ခံစားချက်မဲ့သွားပြီး သူမရဲ့ Emotion တွေ သူမကို ထိန်းချုပ်တာမခံတော့ပါဘူး။ ဒီအချိန်မှာ Joy နဲ့ Sadness တို့အချိန်မှီ ပြန်ရောက်လာပြီး Joy က သူမကမထိန်းချုပ်တော့ပဲ Sadness ကို ထိန်းချုပ်ခိုင်းပါတယ်။ Sadness ကြောင့် ဝမ်းနည်းသွားရတဲ့ Riley က အရင်တုန်းက မိသားစုတူတူ ရှိခဲ့တာတွေ ပြန်သတိရလာပြီး ဘတ်စ်ကားပေါ်ကနေ ဆင်းပြေးကာ အိမ်ကို အရောက်ပြန်သွားပါတယ်။ အိမ်ရောက်တဲ့အခါမှာ ဝမ်းနည်းပက်လက် နဲ့အဖေနဲ့အမေကို သူမခံစားနေရတာကိုဖွင့်ပြောခဲ့ပါတယ်။သူမက အရင်အိမ်နဲ့သူငယ်ချင်းတွေကို လွမ်းတဲ့အကြောင်း ပြောပြရင်း အဖေအမေက နှစ်သိမ့်တာကိုခံယူ ရပြီးနောက် ဝမ်းနည်းမှုနဲ့အတူ မိဘရဲ့ အားပေးမှုကြောင့် စိတ်ကျေနပ်သွားခဲ့ပါတယ်။ ဒါကြောင့် သူမမှာ New Core Memory ဖြစ်လာပြီး ဒီ Core Memory က Gold နဲ့ Blue (ဝမ်းနည်းဝမ်းသာဖြစ်နေပြီး) နှစ်ရောင်ထွက်နေသလို၊ ဒီ Core Memory က သူမရဲ့ အိမ်အသစ် ဖြစ်တဲ့ San Francisco ကအိမ်မှာ အဖေအမေ ရဲ့အားပေးမှု့ကိုရသွားတဲ့ အကြောင်းဖြစ်ပါတယ်။၀မ်းနည်းနေတဲ့အချိန်မှာ ဝမ်းနည်းတာကို အတင်းမျိုသိပ်ထားရင် ကိုယ့်ပတ်ဝန်းကျင်က ကိုယ့်ကို ဂရုစိုက်တဲ့သူတွေက ဘာမှလုပ်ပေးလို့ရမှာမဟုတ်သလို၊ ရင်ထဲကခံစားနေရတာကို ထုတ်ပြဖို့ သင်ခန်းစာပေးထားပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Inside out (2015)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/0a/Inside_Out_%282015_film%29_poster.jpg"
},

{
	review : "အားလုံးသဘောကျကျတဲ့ lego တုံးလေးဇာတ်ကောင်တွေနဲ့ရိုက်ကူးထားတဲ့ဇာတ်ကားလေးရဲ့ ဒုတိယမြောက်ကားလေးပဲဖြစ်ပါတယ်။ဒီကားလေးမှာတော့ အမ်နက်ဆိုတဲ့ အရာရာကိုအကောင်းမြင်တတ်တဲ့စိတ်ရှိသူလေးတစ်ယောက်သူတို့ရဲ့ကမ္ဘာကို ဒပ်ပလိုဂြိုလ်သားတွေလာရောက်တိုက်ခိုက်တဲ့နေရာကနေစတင်ထားပါတယ်။အရာရာမှာအကောင်းမြင်စိတ်ရှိပြီးတော့သဘောကောင်းတဲ့သူလေးဆိုတော့ငါတို့တွေကသူငယ်ချင်းတွေပါဘာညာပြီးတော့စကားလေးနဲ့ဖောပြီးတော့ပြေငြိမ်းမယ်ကြံတာဟိုကလဲမရပါဘူး ဖိုက်ခံရတာပါပဲ။ဒီလိုနဲ့ သူတို့ကမ္ဘာမှာအရာအားလုံးပျက်သုဉ်းနီးပါးဖြစ်နေတဲ့အချိန်မှာသူ့ရဲ့သူငယ်ချင်းတွေကို စင်စတာအဖွဲ့အစည်းကဖမ်းခေါ်သွားပါလေရော။ဒီတော့ အမ်နက်တစ်ယောက် သူ့သူငယ်ချင်းတွေနောက်ကိုကယ်တင်မယ်ဆိုတဲ့စိတ်နဲ့အာကာသယာဉ်လေးဆောက်ပြီး အမှီလိုက်ပါတော့တယ်။ဆိုတော့ အမ်နက်တစ်ယောက်သူငယ်ချင်းတွေကို ကယ်တင်နိုင်ပါ့မလားသူ့သူငယ်ချင်းတွေကိုရော စင်စတာ အဖွဲ့အစည်းကဘာကြောင့်ခေါ်ဆောင်သွားရတယ်ဆိုတာကိုဆက်လက်သိရှိဖို့အတွက် ဇာတ်ကားကိုဆက်ပြီးတော့ ကြည့်လိုက်ရအောင်နော်။Legoဆိုတဲ့အတိုင်းဇာတ်ကောင်လေးတွေကတော်တော်လေးကိုချစ်စရာကောင်းတဲ့အပြင်ဘတ်မန်းရဲ့ပုံစံကတကယ့်ကိုအသဲယားစရာလေးပါ",
	downloadlink : "",
	watchlink : "",
	name : "The lego movie 2 (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/1/10/The_Lego_Movie_poster.jpg"
},

{
	review : "ဒီကာတွန်းကားလေးကတော့ဂျပန်နိင်ငံမှာဝင်ငွေစံချိန် ချိုးခဲ့တဲ့ဇတ်ကားကောင်းလေးတစ်ကားပါပရိတ်သတ် တွေရဲ့အားပေးမှုနဲ့အတူဝင်ငွေဒလဟောရခဲ့တဲ့ကားဆိုလည်းမမှားပါဘူးဇတ်ကားထဲမှာပါဝင်တဲ့သီချင်းလေး တွေကအစဂျပန်နိင်ငံမှာယခုလက်ရှိနာမည်ကြီးသီချင်း တွေအဖြစ်ရပ်တည်နေဆဲပါဒီဇတ်ကားကိုဘလူးရေးက တော့အတော်လေးစောင့်လိုက်ရပါတယ်ထွက်ထွက်ချင်းပဲcm ပရိတ်သတ်တွေကိုကြည့်စေချင်တဲ့စေတနာ ကြောင့်တင်ဆက်ပေးလိုက်ရပါတယ်နှစ်ပေါင်း၁၂၀၀မှာတစ်ကြိမ်သာကမ္ဘာမြေပေါ်ဖြတ်သန်းတဲ့ကြယ်တံခွန် လေးနဲ့အတူလူသားနစ်ဦးရဲ့ဘဝဘယ်လိုပြောင်းလဲသွားမယ်ဆိုတာကိုစိတ်ဝင်တစားကြည့်ရမှာပါထူးဆန်းမှုတွေအချစ်ဇတ်လမ်းတွေနဲ့ဇတ်ကားစလယ်ဆုံးပရိတ်သတ် တွေကိုဆွဲဆောင်သွားမှာပါအကောင်းဆုံးကွာလတီနဲ့မို့သိမ်းထားသင့်တဲ့ဇတ်ကားကောင်းလေးတစ်ကားပါလို့ပြောကြားရင်းဒေါင်းလော့သာဆွဲကြပါကုန်",
	downloadlink : "",
	watchlink : "",
	name : "Your name (2016)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/thumb/0/0b/Your_Name_poster.png/220px-Your_Name_poster.png"
}



];


var marvelarray = [

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Avengers: Endgame (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg"
},
{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Avengers : Infinity War (2018)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/4/4d/Avengers_Infinity_War_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Captain Marvel (2019)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/8/85/Captain_Marvel_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Black Panther (2018)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/d/d6/Black_Panther_%28film%29_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Spiderman: Homecoming (2017)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/f/f9/Spider-Man_Homecoming_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Captain America: Civil War (2016)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/5/53/Captain_America_Civil_War_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Doctor Strange (2016)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/c/c7/Doctor_Strange_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Avengers: Age of Ultron (2015)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/f/ff/Avengers_Age_of_Ultron_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Thor (2011)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/f/fc/Thor_poster.jpg"
},

{
	review : "Marvel ထုတ်လုပ်ရေးမှ Marvel Cinematic Universe(MCU) ကို လွန်ခဲ့တဲ့ ၁၀ နှစ်က စပြီးတည်ဆောက်ခဲ့ပါတယ်။ပထမဆုံး ဇာတ်လမ်းဖြစ်တဲ့ Iron Man-1 နဲ့ဖြစ်ပါတယ်။ နောက်ဆုံးအပိတ်ကတော့ Endgame (2019) ဖြစ်ပါတယ်။Marvel Universe မှာ Infinity Stone လို့ ခေါ်တဲ့ စွမ်းအား အကြီးဆုံး ကျောက်တုံး(၆) လုံးရှိပါတယ်။အဲဒီကျောက်တုံးတွေဟာ စကြဝဠာအနှံ့မှာ ပြန့်ကျဲနေတယ် ဆိုပါတော့။ကျောက်တုံးတစ်တုံးချင်းစီမှာ သီးခြားအစွမ်းတွေ ရှိပြီး သာမာန်လူတွေ ကိုင်တွယ်သုံးစွဲဖို့ မဖြစ်နိုင်သလောက်ပါပဲ။Infinity War ရဲ့ အဓိက ဗီလိန်ဖြစ်တဲ့ Mad titan လို့ခေါ်ကြတဲ့ Thanos က ဒီကျောက်တုံးတွေကို စုစည်းပြီးစကြဝဠာကို သူ့သဘောအတိုင်းဖန်တီးဖို့ကြိုးစားပါလိမ့်မယ်။ဒါကို Avengers( Captain America, Iron Man, Hulk, Thor, Black Widow, Hawkeye, Vision,Scarlet Witch,Antman,Falcon) တို့နဲ့Spiderman, Doctor Strange, Black Panther, Guardians of the Galaxy အဖွဲ့တို့ ပူးပေါင်းတားဆီးကြရင်း ဖြစ်လာတဲ့ စစ်ပွဲပါ။Infinity Stones 6 လုံးရဲ့ တည်နေရာတွေကတော့၁. Space Stone aka Tesseract (Blue)(Captain America: the first avenger ဇာတ်ကားမှာ နာဇီတွေဆီက လုယူရတဲ့ ကျောက်တုံးဖြစ်ပြီးAvengers ဇာတ်ကားမှာ လိုကီက ဂြိုလ်သားတွေကို ကမ္ဘာကိုခေါ်ဖို့ ဝင်ပေါက်ဖွင့်တဲ့နေရာမှာ အသုံးပြုခဲ့ပါတယ်၊လက်ရှိကတော့ Asgard ဂြိုလ်ပေါ်မှာ သိမ်းဆည်းခဲ့ရင်း Thor: Ragnarok ကားအဆုံးမှာ လိုကီ ခိုးယူခဲ့တာကို တွေ့ရမှာပါ)၂။ Reality Stone aka Aether (Red)( စကြဝဠာကို Big Bang မတိုင်ခင်အထိတောင် ပြန်ပြောင်းပစ်နိုင်ပါတယ်။Thor 2: The Dark World မှာ ပါလာခဲ့ပြီး နောက်ဆုံး credit scene မှာ Collector ဆိုသူဆီမှာ သိမ်းဆည်းထားပါတယ်)၃။ Power Stone (Purple Orb)( ဂြိုလ်တစ်ခုလုံးကို အသာလေးဖျက်ပစ်လို့ရတဲ့ raw power တွေပါပါတယ်။Guardian of the Galaxy 1 မှာ ပါဝင်ခဲ့ပြီး Xander က Nova Corps စစ်တပ်လက်ထဲမှာ သိမ်းဆည်းထားပါတယ်။)၄။ The Time Stone ( The Eye of Agomotto, Green)( အချိန်ကို လိုသလိုအသုံးချနိုင်ပါတယ်။ Doctor Starnge ဇာတ်လမ်းမှာ ပါဝင်လာပြီး လက်ရှိ ဒေါက်တာ စထ်ရိန့်က စောင့်ရှောက်ထားပါတယ်)၅။ Mind Stone (Yellow)( ဉာဏ်ရည်ကို မြှင့်တင်ခြင်းနဲ့ စိတ်ညို့ခြင်းတွေ ပြုလုပ်နိုင်ပါတယ်။ Avengers 1 မှာ ပါဝင်ခဲ့ပြီး လက်ရှိ Vision ရဲ့ နဖူးထဲမှာ မြှပ်ထားတာပါ)၆။ Soul Stone (Orange)( သက်ရှိ သက်မဲ့ အခြေအနေတွေကို ထိန်းချုပ်နိုင်ပါတယ်။ Planet Vormir မှာရှိပါတယ်။ )အဆိုပါ ကျောက်တုံး ၆ တုံးကို သုံးနိုင်ဖို့ Infinity Gauntlet ဆိုတဲ့ လက်အိတ်ကို လိုပါတယ်။ အဲဒီလက်အိတ်ကိုတော့ Thanos ပိုင်ဆိုင်ထားပါတယ်။ဒီလောက်ဆို Marvel Universe ကိုကြည့်ဖို့ အကြမ်းဖျဉ်းလုံလောက်ပြီ ထင်ပါတယ်။",
	downloadlink : "",
	watchlink : "",
	name : "Ironman 3 (2013)" ,
	thumbnail : "https://upload.wikimedia.org/wikipedia/en/0/00/Iron_Man_poster.jpg"
}
];

var aboutarray = [
{
	detail : "This is a movie app. You can download Movies and directly watch from the app.Enjoy our app by exploring lastest movies."
}

];





var action = document.getElementsByClassName("action")[0];
var adventure = document.getElementsByClassName("adventure")[0];
var animation = document.getElementsByClassName("animation")[0];
var marvel = document.getElementsByClassName("marvel")[0];


var action_adventure = actionarray.concat(adventurearray);
var animation_marvel = animationarray.concat(marvelarray);

var allarray = action_adventure.concat(animation_marvel);


marvelarray.map(function(user,i){

	marvel.innerHTML += `
		<div class="marvelphotos">
			<img class="picture" src="${marvelarray[i].thumbnail}">
			<div class="piclabel">${marvelarray[i].name}</div>
		</div>
	`;

})

actionarray.map(function(user,i){

	action.innerHTML += `
		<div class="actionphotos">
			<img class="picture" src="${actionarray[i].thumbnail}">
			<div class="piclabel">${actionarray[i].name}</div>
		</div>
	`;

})

adventurearray.map(function(user,i){

	adventure.innerHTML += `
		<div class="adventurephotos">
			<img class="picture" src="${adventurearray[i].thumbnail}">
			<div class="piclabel">${adventurearray[i].name}</div>
		</div>
	`;

})

animationarray.map(function(user,i){

	animation.innerHTML += `
		<div class="animationphotos">
			<img class="picture" src="${animationarray[i].thumbnail}">
			<div class="piclabel">${animationarray[i].name}</div>
		</div>
	`;

})

var resultView = document.getElementsByClassName("resultView")[0];
var container = document.getElementsByClassName("container")[0];



var sync;
function OninputSearch(){
	exit_movie_review();
	tab.forEach(function(node){
			node.style.display = "none";
	});
	var filteredMovies = allarray.filter(function(names){
	return names.name.toLowerCase().includes(searchbar.value.toLowerCase());
})
	sync = filteredMovies;
	if (searchbar.value === "") {
		resultView.style.display = "none";
		container.style.display = "block";
		container.classList.remove("containerdisappear");
		resultView.classList.remove("resultViewappear");
	}
	else{
		resultView.style.display = "block";
		container.style.display = "none";
		container.classList.add("containerdisappear");
		resultView.classList.add("resultViewappear");
		resultView.innerHTML = `<div class='resultvalue' align="left">${sync.length} Result(s) of "${searchbar.value}" found!</div>`;
	filteredMovies.map(function(user,i){
	resultView.innerHTML += `
		<div class="resultMovie" onclick="open_result_movie_review(${i})">
			<img class="picture" src="${filteredMovies[i].thumbnail}">
			<div class="piclabel">${filteredMovies[i].name}</div>
		</div>
	`;
})//map_close
	}

}//function_close
const animationshowall = () =>{
	animation.classList.toggle("whitespace");
}
const marvelshowall = () =>{
	marvel.classList.toggle("whitespace");
}
const actionshowall = () =>{
	action.classList.toggle("whitespace");
}
const adventureshowall = () =>{
	adventure.classList.toggle("whitespace");
}
const darkside = document.getElementsByClassName("darkside")[0];
const menulist = document.getElementsByClassName("menulist")[0];

const openmenu = () =>{
	darkside.classList.toggle("darksideappear");
	menulist.classList.toggle("menulistappear");
	searchbar.style.animation = "";
	setTimeout(function(){
		searchbar.style.animation = "searchanimate 1.5s";
	},50);
	search.style.animation = "";
	setTimeout(function(){
		search.style.animation = "searchanimate 1.5s";
	},50);
	search.classList.remove("searchdivchange");
	searchbar.classList.remove("searchappear");
	label.classList.remove("labeldisappear");
	searchbar.value = "";
	// OninputSearch();
}
const closemenu = () =>{
	darkside.classList.remove("darksideappear");
	menulist.classList.remove("menulistappear");
}



var tab = document.querySelectorAll(".tab");

function tabclick(i){
	con_result_close();
	exit_movie_review();
	closemenu();
	tab.forEach(function(node){
			node.style.display = "none";
	});
	tab[i].style.display = "block";


}


function con_result_close(){
	container.style.display = "none";
	resultView.style.display = "none";
}

function all_close(){
	tab.forEach(function(node){
			node.style.display = "none";
	});
	resultView.style.display = "none";
}

function homeclick(){
	closemenu();
	all_close();
	exit_movie_review();
	container.style.display = "block";
}


actionarray.map(function(user,i){

	tab[0].innerHTML += `
		<div class="actionphotos_filter">
			<img class="picture" src="${actionarray[i].thumbnail}">
			<div class="piclabel">${actionarray[i].name}</div>
		</div>
	`;

})

adventurearray.map(function(user,i){

	tab[1].innerHTML += `
		<div class="adventurephotos_filter">
			<img class="picture" src="${adventurearray[i].thumbnail}">
			<div class="piclabel">${adventurearray[i].name}</div>
		</div>
	`;

})


animationarray.map(function(user,i){

	tab[2].innerHTML += `
		<div class="animationphotos_filter">
			<img class="picture" src="${animationarray[i].thumbnail}">
			<div class="piclabel">${animationarray[i].name}</div>
		</div>
	`;

})


marvelarray.map(function(user,i){

	tab[3].innerHTML += `
		<div class="marvelphotos_filter">
			<img class="picture" src="${marvelarray[i].thumbnail}">
			<div class="piclabel">${marvelarray[i].name}</div>
		</div>
	`;

})
 tab[4].innerHTML += `
 	<div><img src="movieicon.jpg" width="350" height="350"></div>
 	<div class="about_detail">
 	${aboutarray[0].detail}
 	</div>
 `;


const movie_about_link = document.getElementsByClassName("movie_about_link")[0];
const movie_about = document.getElementsByClassName("movie_about")[0];
const movie_title = document.getElementsByClassName("movie_title")[0];
var movie_down_link = document.getElementsByClassName("movie_down_link")[0];
const movie_watch_link = document.getElementsByClassName("movie_watch_link")[0];
var movie_poster = document.getElementsByClassName("movie_poster")[0];
var adventurephotos = document.querySelectorAll(".adventurephotos");
var actionphotos = document.querySelectorAll(".actionphotos");
var marvelphotos = document.querySelectorAll(".marvelphotos");
var animationphotos = document.querySelectorAll(".animationphotos");
var action_adventure_photos = Array.prototype.slice.call(document.querySelectorAll(".actionphotos")).concat(Array.prototype.slice.call(document.querySelectorAll(".adventurephotos")));

var animation_marvel_photos = Array.prototype.slice.call(document.querySelectorAll(".animationphotos")).concat(Array.prototype.slice.call(document.querySelectorAll(".marvelphotos")));

var allphotos = action_adventure_photos.concat(animation_marvel_photos);







var adventurephotos_filter = document.querySelectorAll(".adventurephotos_filter");
var actionphotos_filter= document.querySelectorAll(".actionphotos_filter");
var marvelphotos_filter = document.querySelectorAll(".marvelphotos_filter");
var animationphotos_filter = document.querySelectorAll(".animationphotos_filter");

var action_adventure_photos_filter = Array.prototype.slice.call(document.querySelectorAll(".actionphotos_filter")).concat(Array.prototype.slice.call(document.querySelectorAll(".adventurephotos_filter")));
var animation_marvel_photos_filter = Array.prototype.slice.call(document.querySelectorAll(".animationphotos_filter")).concat(Array.prototype.slice.call(document.querySelectorAll(".marvelphotos_filter")));

var allphotos_filter = action_adventure_photos_filter.concat(animation_marvel_photos_filter);



const exit_movie_review = () =>{
	movie_about_link.classList.remove("movie_about_link_appear");
	movie_title.innerHTML = `<button class="movie_review_btn" onclick="exit_movie_review()">X</button>`;
}
const open_movie_review = (index) =>{
	movie_about_link.classList.add("movie_about_link_appear");
	movie_title.innerHTML += `-${allarray[index].name}-`;
	movie_poster.src = allarray[index].thumbnail;
	movie_about.textContent = allarray[index].review;
	movie_watch_link.href = allarray[index].watchlink;
	movie_down_link.href = allarray[index].downloadlink;

}
allphotos.forEach((node,i)=>{
node.setAttribute("onclick",`open_movie_review(${i})`);
});

allphotos_filter.forEach((node,i)=>{
node.setAttribute("onclick",`open_movie_review(${i})`);
});

const open_result_movie_review = (index) =>{
		movie_about_link.classList.add("movie_about_link_appear");
	movie_title.innerHTML += `-${sync[index].name}-`;
	movie_poster.src = sync[index].thumbnail;
	movie_about.textContent = sync[index].review;
	movie_watch_link.href = sync[index].watchlink;
	movie_down_link.href = sync[index].downloadlink;
}
